{
  "common": {
    "name": "zendure-solarflow",
    "version": "1.8.7",
    "news": {
      "1.8.7": {
        "en": "Fix missing control states for AIO",
        "de": "Fehlende Kontrollzustände für AIO behoben",
        "ru": "Исправление недостающих состояний управления для AIO",
        "pt": "Corrigir estados de controle ausentes para AIO",
        "nl": "Fix ontbrekende controlestaten voor AIO",
        "fr": "Correction des états de contrôle manquants pour AIO",
        "it": "Fissare gli stati di controllo mancanti per AIO",
        "es": "Fijar estados de control perdidos para AIO",
        "pl": "Napraw brakujące stany kontroli dla AIO",
        "uk": "Виправлення відсутніх контрольних станів для AIO",
        "zh-cn": "为 AIO 修复缺失的控制状态"
      },
      "1.8.6": {
        "en": "Change login method: Added a retry loop for connecting to Zendure Cloud, if the Cloud Service \"hangs\" or is not available it will retry the connection 3 times.",
        "de": "Login-Methode ändern: Hinzugefügt eine Retry-Loop für die Verbindung mit Zendure Cloud, wenn der Cloud Service \"Ändert\" oder nicht verfügbar ist, wird es die Verbindung 3 mal wiederherzustellen.",
        "ru": "Изменение метода входа: Добавлена петля для подключения к Zendure Cloud, если облачная служба «висит» или недоступна, она перепробует соединение 3 раза.",
        "pt": "Alterar método de login: Adicionado um loop de retificação para se conectar ao Zendure Cloud, se o serviço de nuvem \"hangs\" ou não está disponível ele vai retenta a conexão 3 vezes.",
        "nl": "Aanmeldmethode wijzigen: Een retry-lus toegevoegd om verbinding te maken met Zendure Cloud, als de Cloud Service \"hangt\" of niet beschikbaar is, zal het de verbinding 3 keer opnieuw proberen.",
        "fr": "Modifier la méthode de connexion & #160;: Ajout d'une boucle de réessayer pour se connecter à Zendure Cloud, si le service Cloud \"hangs\" ou n'est pas disponible, il réessayera la connexion 3 fois.",
        "it": "Modifica del metodo di login: Aggiunto un loop di riprovazione per il collegamento a Zendure Cloud, se il servizio cloud \"impicca\" o non è disponibile, riproverà la connessione 3 volte.",
        "es": "Cambiar método de inicio de sesión: Se agregó un bucle de reingreso para conectarse a Zendure Cloud, si el Servicio Cloud \"hangs\" o no está disponible, volverá a iniciar la conexión 3 veces.",
        "pl": "Zmień metodę logowania: Dodano pętlę ponowną do podłączenia do Zharb Cloud, jeśli Cloud Service \"zawiśnie\" lub nie jest dostępna, ponownie wypróbuje połączenie 3 razy.",
        "uk": "Спосіб зміни логіки: Додана птиця петля для підключення до Zendure Cloud, якщо Хмарна служба \"хвишки\" або не доступна вона буде переробляти з'єднання 3 рази.",
        "zh-cn": "更改登录方法 : 添加了连接到 Zendure 云的重试循环, 如果云服务“ hangs” 或无法使用, 它将重试连接三次 ."
      },
      "1.8.5": {
        "en": "Fix missing states for new HUB Firmware when connected to ACE\nFix corrent max value for AIO",
        "de": "Fix fehlende Zustände für neue HUB Firmware, wenn mit ACE verbunden\nKorrent max Wert für AIO festsetzen",
        "ru": "Исправление недостающих состояний для нового HUB Firmware при подключении к ACE\nМакс. значение для AIO",
        "pt": "Corrigir estados ausentes para novo HUB Firmware quando conectado à ACE\nCorrigir o valor máximo correspondente para AIO",
        "nl": "Fix ontbrekende toestanden voor nieuwe HUB Firmware wanneer aangesloten op ACE\nFix corresponderende maximale waarde voor AIO",
        "fr": "Correction des états manquants pour le nouveau micrologiciel HUB lorsqu'il est connecté à ACE\nFixe la valeur maximale corrente pour AIO",
        "it": "Fissare gli stati mancanti per il nuovo firmware HUB quando collegato ad ACE\nCorrente di fissaggio del valore massimo per AIO",
        "es": "Fijar estados perdidos para el nuevo HUB Firmware cuando conectado a ACE\nValor máximo corregido para AIO",
        "pl": "Naprawianie brakujących stanów dla nowego oprogramowania HUB po podłączeniu do ACE\nPopraw maksymalną wartość corrent dla AIO",
        "uk": "Виправлення відсутніх штатів для прошивки HUB при підключенні до ACE\nФіксувати коструктивне значення для AIO",
        "zh-cn": "连接到 ACE 时将新 HUB 固件状态修复为缺失状态\n修正 AIO 的最大同位素值"
      },
      "1.8.4": {
        "en": "Add support for Smart Plug, but only Power is available at the moment - unstable as often data is not updated by MQTT\nSome code improvements",
        "de": "Unterstützung für Smart Plug hinzufügen, aber nur Power ist im Moment verfügbar - instabil, da die Daten nicht von MQTT aktualisiert werden\nEinige Code-Verbesserungen",
        "ru": "Добавить поддержку Smart Plug, но в данный момент доступна только Power - нестабильные, так как часто данные не обновляются MQTT\nНекоторые улучшения кода",
        "pt": "Adicionar suporte para Smart Plug, mas apenas o Power está disponível no momento - instável como muitas vezes os dados não são atualizados pelo MQTT\nAlgumas melhorias de código",
        "nl": "Ondersteuning toevoegen voor Smart Plug, maar alleen Power is beschikbaar op dit moment - onstabiel omdat vaak gegevens niet worden bijgewerkt door MQTT\nEnkele code verbeteringen",
        "fr": "Ajoutez le support pour Smart Plug, mais seule l'alimentation est disponible en ce moment - instable comme souvent les données ne sont pas mises à jour par MQTT\nQuelques améliorations de code",
        "it": "Aggiungi supporto per Smart Plug, ma solo Power è disponibile al momento - instabile come spesso i dati non sono aggiornati da MQTT\nAlcuni miglioramenti del codice",
        "es": "Añadir soporte para Smart Plug, pero sólo Power está disponible en este momento - inestable ya que los datos a menudo no es actualizado por MQTT\nAlgunas mejoras de código",
        "pl": "Dodaj wsparcie dla Smart Plug, ale tylko Moc jest dostępna w tej chwili - niestabilne jak często dane nie są aktualizowane przez MQTT\nNiektóre ulepszenia kodów",
        "uk": "Додати підтримку для Smart Plug, але тільки Потужність доступна в даний момент - нестабільна, як часто дані не оновлюються MQTT\nДеякі покращення коду",
        "zh-cn": "添加 Smart Plug 支持, 但目前只有 Power 可用 - 数据经常不由 MQTT 更新而不稳定\n一些代码改进"
      },
      "1.8.3": {
        "en": "Fix SOC and energyWhMax Value (counted by type of attached batteries)\nAdd Calculation for Grid Input (only for Ace 1500 and Hyper 2000)\nFix suggestions by ioBroker repository checker",
        "de": "SOC und EnergyWhMax-Wert (gezählt nach Art der angeschlossenen Batterien)\nBerechnung für Grid Input hinzufügen (nur für Ace 1500 und Hyper 2000)\nFix Vorschläge von ioBroker Repository Checker",
        "ru": "Fix SOC и EnergyWhMax Value (с учетом типа прикрепленных батарей)\nДобавить подсчет для ввода сетки (только для Ace 1500 и Hyper 2000)\nИсправления предложения значка хранилища ioBroker",
        "pt": "Fix SOC e EnergyWhMax Valor (contado por tipo de baterias anexadas)\nAdicionar cálculo para entrada de grade (apenas para Ace 1500 e Hyper 2000)\nCorrigir sugestões pelo verificador de repositório ioBroker",
        "nl": "Fix SOC en energyWhMax Value (telt per type aangesloten batterijen)\nBerekening toevoegen voor rasterinvoer (alleen voor Ace 1500 en Hyper 2000)\nRepareer suggesties door ioBroker repository checker",
        "fr": "Fix SOC et énergieWhMax Valeur (comptabilisée par type de piles attachées)\nAjouter le calcul pour l'entrée du réseau (uniquement pour Ace 1500 et Hyper 2000)\nCorrection des suggestions par le vérificateur de dépôt ioBroker",
        "it": "Fix SOC e EnergyWhMax Valore (conto per tipo di batterie allegate)\nAggiungi Calcolo per Grid Input (solo per Ace 1500 e Hyper 2000)\nFissare i suggerimenti di ioBroker repository checker",
        "es": "Fijar SOC y energíaWhMax Value (contada por tipo de baterías adjuntas)\nAñada Cálculo para Entrada Grid (sólo para Ace 1500 e Hyper 2000)\nSugerencias de fijación por ioBroker repositorio checker",
        "pl": "Fix SOC i energyWhMax Value (liczony według typu dołączonych baterii)\nDodaj obliczenie wejścia siatki (tylko dla Asa 1500 i Hyper 2000)\nPoprawianie sugestii przez sprawdzacz repozytorium jOBroker",
        "uk": "Фіксація SOC та енергіяWhMax Значення (з урахуванням типу прикріплених батарей)\nДодати розрахунок для входу в мережу (тільки для Ace 1500 і Hyper 2000)\nВиправлення пропозицій на репозиторію ioBroker",
        "zh-cn": "固定SOC和能量WhMax值(按附电池类型计算)\n添加网格输入计算(仅A 1500和Hyper 2000)\n由 ioBroker 仓库检查器修复建议"
      },
      "1.7.7": {
        "en": "Fix Input and Output limit for Hyper 2000",
        "de": "Fixe Eingangs- und Ausgangsgrenze für Hyper 2000",
        "ru": "Предельный уровень ввода и вывода для Hyper 2000",
        "pt": "Limite de entrada e saída para Hyper 2000",
        "nl": "Fix Input and Output limit for Hyper 2000",
        "fr": "Fixer la limite d'entrée et de sortie pour Hyper 2000",
        "it": "Limite di ingresso e uscita per Hyper 2000",
        "es": "Límite de entrada y salida fijo para Hyper 2000",
        "pl": "Limit wejścia i wyjścia dla Hyper 2000",
        "uk": "Фіксувати вхідні та вихідні обмеження для Hyper 2000",
        "zh-cn": "Hyper 2000 输入和输出限制"
      },
      "1.7.6": {
        "en": "Fix support for 'Hyper_Test' devices\nImproved code for state creation",
        "de": "Unterstützung für 'Hyper_Test'-Geräte beheben\nVerbesserter Code für die staatliche Schöpfung",
        "ru": "Поддержка 'Hyper_Test'\nУлучшенный код для создания государства",
        "pt": "Suporte fixo para dispositivos 'Hyper_Test'\nCódigo melhorado para a criação do estado",
        "nl": "Ondersteuning voor 'Hyper_Test'-apparaten herstellen\nVerbeterde code voor het aanmaken van staten",
        "fr": "Correction de la prise en charge des périphériques 'Hyper_Test'\nCode amélioré pour la création d'État",
        "it": "Supporto per dispositivi 'Hyper_Test'\nCodice migliorato per la creazione di stato",
        "es": "Soporte fijo para dispositivos 'Hyper_Test'\nCódigo mejorado para la creación del estado",
        "pl": "Napraw obsługę urządzeń 'Hyper _ Test'\nUlepszony kodeks tworzenia państwa",
        "uk": "Фіксована підтримка пристроїв «Hyper_Test»\nПокращений код для державного створення",
        "zh-cn": "修正“ Hyper_ test” 设备的支持\n改进国家创建的代码"
      }
    },
    "titleLang": {
      "en": "Zendure Solarflow",
      "de": "Zendure Solarflow",
      "ru": "Зендуре Соларфлоу",
      "pt": "Zendure Solarflow",
      "nl": "Zendure Solarflow",
      "fr": "Flux solaire Zendure",
      "it": "Zendur Solarflow",
      "es": "Zendure Solarflow",
      "pl": "Zendure Solarflow",
      "uk": "Zendure Solarflow",
      "zh-cn": "Zendure Solarflow"
    },
    "desc": {
      "en": "zendure-solarflow",
      "de": "Zendure-Solarflow",
      "ru": "Zendure-Solarflow",
      "pt": "zendure-solarflow",
      "nl": "zendure-solarflow",
      "fr": "zendure-solarflow",
      "it": "zendure-solarflow",
      "es": "flujo-solar-zendure",
      "pl": "zendure-solarflow",
      "uk": "zendure-solarflow",
      "zh-cn": "zendure-solarflow"
    },
    "authors": [
      "Peter <peter.frommert@outlook.com>"
    ],
    "keywords": [
      "Zendure",
      "Solarflow"
    ],
    "licenseInformation": {
      "license": "GPL-3.0-only",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "icon": "zendure-solarflow.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/nograx/ioBroker.zendure-solarflow/main/admin/zendure-solarflow.png",
    "readme": "https://github.com/nograx/ioBroker.zendure-solarflow/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "energy",
    "tier": 2,
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "adminUI": {
      "config": "materialize"
    },
    "eraseOnUpload": true,
    "dependencies": [
      {
        "js-controller": ">=5.0.19"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.0.0"
      }
    ]
  },
  "native": {
    "userName": "",
    "server": "global",
    "useCalculation": false,
    "useLowVoltageBlock": false
  },
  "encryptedNative": [
    "password"
  ],
  "protectedNative": [
    "password"
  ],
  "objects": [],
  "instanceObjects": []
}
