{
  "common": {
    "name": "zendure-solarflow",
    "version": "1.1.0",
    "news": {
      "1.1.0": {
        "en": "Switched solar input 1 und 2 to adjust the behavior like the offical app\nAdded Calculations folder, remaining charge and discharge time is now available as formatted time\nAdded a note in the settings that this adapter only works with the global server",
        "de": "Solareingang 1 und 2 zum Einstellen des Verhaltens wie die Offical App\nHinzufügen Berechnungsordner, Restladung und Entladung Zeit ist jetzt als formatierte Zeit verfügbar\nFügen Sie eine Notiz in den Einstellungen hinzu, die dieser Adapter nur mit dem globalen Server funktioniert",
        "ru": "Переключение солнечного ввода 1 und 2 для корректировки поведения, как оффическое приложение\nДобавить папку расчета, оставшееся время заряда и выгрузки теперь доступно как отформатированное время\nДобавлена нота в настройках, что этот адаптер работает только с глобальным сервером",
        "pt": "Entrada solar comutada 1 und 2 para ajustar o comportamento como o aplicativo offical\nAdicionado pasta Cálculos, restante carga e tempo de descarga está agora disponível como tempo formatado\nAdicionado uma nota nas configurações que este adaptador só funciona com o servidor global",
        "nl": "Schakelde zonne-input 1 und 2 om het gedrag aan te passen zoals de officale app\nToegevoegde rekenmap, resterende lading en ontladingstijd is nu beschikbaar als geformatteerde tijd\nEen opmerking toegevoegd in de instellingen dat deze adapter alleen werkt met de globale server",
        "fr": "Entrée solaire commutée 1 et 2 pour ajuster le comportement comme l'application offical\nAjout du dossier Calculs, la charge restante et le temps de décharge sont maintenant disponibles en formatage\nAjout d'une note dans les paramètres que cet adaptateur ne fonctionne qu'avec le serveur global",
        "it": "Ingresso solare commutato 1 und 2 per regolare il comportamento come l'app offical\nAggiunta cartella Calculazioni, carica rimanente e tempo di scarico è ora disponibile come tempo formattato\nAggiunto una nota nelle impostazioni che questo adattatore funziona solo con il server globale",
        "es": "Interrupción de entrada solar 1 und 2 para ajustar el comportamiento como la aplicación offical\nCarpeta de cálculos añadidos, tiempo de carga y descarga restante está disponible ahora como tiempo formateado\nSe agregó una nota en la configuración que este adaptador sólo funciona con el servidor global",
        "pl": "Switched solar input 1 und 2 to adjustic the behavior like the official app\nDodano folder Obliczeń, pozostały czas ładowania i rozładowania jest teraz dostępny jako sformatowany czas\nDodano notatkę w ustawieniach, że ten adapter działa tylko z globalnym serwerem",
        "uk": "Переключений сонячний вхід 1 унд 2 для регулювання поведінки, як офичний додаток\nДодано папку Розрахунок, що залишився заряд і час розряду тепер доступний як форматований час\nДодано замітку в налаштуваннях, які цей адаптер працює тільки з глобальним сервером",
        "zh-cn": "切换太阳输入 1 und 2 以调整类似外科应用的行为\n已添加计算文件夹、剩余充电和放电时间已作为格式化时间提供\n在设置中添加了一个注释, 该适配器只与全局服务器工作"
      },
      "1.0.7": {
        "en": "Add control for charge and discharge limit\nUpdate Readme Screenshot",
        "de": "Steuerung für Lade- und Entladegrenzen hinzufügen\nUpdate Readme Screenshot",
        "ru": "Добавить контроль за лимитом заряда и разряда\nОбновление Редакция экрана",
        "pt": "Adicionar controle para o limite de carga e descarga\nActualizar Screenshot de Readme",
        "nl": "Controle toevoegen voor lading en ontladingslimiet\nSchermafdruk bijwerken",
        "fr": "Ajouter le contrôle pour la charge et la limite de décharge\nMettre à jour la capture d'écran Readme",
        "it": "Aggiungere il controllo per il limite di carica e scarico\nAggiornamento Readme Screenshot",
        "es": "Agregar control para el límite de carga y descarga\nUpdate Readme Captura de Pantalla",
        "pl": "Dodawanie kontroli dla doładowania i rozładowania\nAktualizacja zrzutu ekranu Readme",
        "uk": "Додати контроль за лімітом заряду та розряду\nUpdate Readme Скріншот",
        "zh-cn": "添加充电和放电限制的控制\n更新 Readme 屏幕截图"
      },
      "1.0.6": {
        "en": "Update Readme",
        "de": "Update Reader",
        "ru": "Readme",
        "pt": "Atualizar o Readme",
        "nl": "Readme bijwerken",
        "fr": "Mettre à jour Readme",
        "it": "Aggiornamento",
        "es": "Actualización Readme",
        "pl": "Aktualizacja Readme",
        "uk": "Оновлення Readme",
        "zh-cn": "更新读取器"
      },
      "1.0.5": {
        "en": "Added state for both Solarflow PV inputs",
        "de": "Zusätzlicher Zustand für beide Solarflow PV-Eingänge",
        "ru": "Добавленное состояние для обоих компонентов Solarflow PV",
        "pt": "Estado adicionado para ambas as entradas Solarflow PV",
        "nl": "Toegevoegde toestand voor beide Solarflow PV-inputs",
        "fr": "État ajouté pour les deux entrées Solarflow PV",
        "it": "Stato aggiunto per entrambi gli ingressi Solarflow PV",
        "es": "Estado añadido para ambas entradas de PV de flujo solar",
        "pl": "Dodano stan dla obu wejść Solarflow PV",
        "uk": "Додано стан для обох вхідних сонячних батарей",
        "zh-cn": "两种太阳流光电输入的添加状态"
      },
      "1.0.4": {
        "en": "Added Timeout for axios",
        "de": "Timeout für Axios hinzugefügt",
        "ru": "Добавлено Timeout для axios",
        "pt": "Adicionado Timeout para axios",
        "nl": "Axios",
        "fr": "Ajout du timeout pour axios",
        "it": "Aggiunto Timeout per assios",
        "es": "Tiempo añadido para el eje",
        "pl": "Added Timeout",
        "uk": "Додано час для axios",
        "zh-cn": "增加焦虑时间"
      },
      "1.0.3": {
        "en": "Password is now encrypted. NOTE: You have to re-enter the password after adapter update!",
        "de": "Passwort ist jetzt verschlüsselt. HINWEIS: Sie müssen das Passwort nach dem Update des Adapters neu eingeben!",
        "ru": "Пароль теперь зашифрован. ПРИМЕЧАНИЕ: Вы должны повторно ввести пароль после обновления адаптера!",
        "pt": "A senha é agora criptografada. NOTA: Você tem que reinserir a senha após a atualização do adaptador!",
        "nl": "Het wachtwoord is nu versleuteld. Je moet het wachtwoord herstellen na de update van de adapter!",
        "fr": "Le mot de passe est désormais crypté. REMARQUE: Vous devez retourner le mot de passe après la mise à jour de l'adaptateur!",
        "it": "La password è ora crittografata. NOTA: Devi reinserire la password dopo l'aggiornamento dell'adattatore!",
        "es": "La contraseña está ahora encriptada. NOTA: ¡Tienes que volver a introducir la contraseña después de la actualización del adaptador!",
        "pl": "Obecnie hasło jest szyfrowane. NOTE: Musisz wrócić do hasła po adapteru!",
        "uk": "Пароль тепер зашифрований. ОНОВЛЕННЯ: Ви повинні повторно реєструвати пароль після оновлення адаптера!",
        "zh-cn": "护照现在加密。 注:你必须在适应者更新之后重新加入文字。!"
      },
      "1.0.2": {
        "en": "Adapter improvements suggested by iobroker team\nFixed battery pack temperature (data is in kelvin, so now converting to celcius)",
        "de": "Adapter Verbesserungen vorgeschlagen von iobroker team\nFeste Akku-Pack-Temperatur (Daten sind in Kelvin, also jetzt in celcius umwandeln)",
        "ru": "Улучшения адаптера, предложенные командой iobroker\nФиксированная температура аккумулятора (данные находятся в kelvin, поэтому теперь преобразование в celcius)",
        "pt": "Melhorias do adaptador sugeridas pela equipe iobroker\nTemperatura do pacote de bateria fixa (os dados estão em kelvin, então agora convertendo em celcius)",
        "nl": "Adapter verbetering suggereert\nGerepareerde batterijttemperatuur (data is in kelvin, dus nu omkeren naar Cecius)",
        "fr": "Amélioration de l'adaptateur suggérée par l'équipe iobroker\nTempérature de la batterie fixe (les données sont dans kelvin, donc maintenant convertir en celcius)",
        "it": "Miglioramenti dell'adattatore suggeriti dal team di iobroker\nTemperatura del pacchetto batterie fissa (i dati sono in kelvin, quindi ora convertiti in celcius)",
        "es": "Mejoras del adaptador sugeridas por el equipo de iobroker\nTemperatura de paquete de batería fija (data está en kelvin, por lo que ahora se convierte en celcio)",
        "pl": "Adapter ulepszenia sugerowały zespół iobroker\nFixed battery pack temperature (data jest w kelvinu, więc teraz przekształca się w celcius)",
        "uk": "Покращення адаптерів, запропонованих командою iobroker\nФіксована температура пакета акумулятора (data is in kelvin, тому тепер перетворюється в celcius)",
        "zh-cn": "气雾器组建议的改进\n固定电池的包装温度(数据是镍vin,因此现在转换为管道)。"
      }
    },
    "title": "Zendure Solarflow",
    "titleLang": {
      "en": "Zendure Solarflow",
      "de": "Zendure Solarflow",
      "ru": "Зендуре Соларфлоу",
      "pt": "Zendure Solarflow",
      "nl": "Zendure Solarflow",
      "fr": "Flux solaire Zendure",
      "it": "Zendur Solarflow",
      "es": "Zendure Solarflow",
      "pl": "Zendure Solarflow",
      "uk": "Zendure Solarflow",
      "zh-cn": "Zendure Solarflow"
    },
    "desc": {
      "en": "zendure-solarflow",
      "de": "Zendure-Solarflow",
      "ru": "Zendure-Solarflow",
      "pt": "zendure-solarflow",
      "nl": "zendure-solarflow",
      "fr": "zendure-solarflow",
      "it": "zendure-solarflow",
      "es": "flujo-solar-zendure",
      "pl": "zendure-solarflow",
      "uk": "zendure-solarflow",
      "zh-cn": "zendure-solarflow"
    },
    "authors": [
      "Peter <peter.frommert@outlook.com>"
    ],
    "keywords": [
      "Zendure",
      "Solarflow"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "main": "build/main.js",
    "icon": "zendure-solarflow.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/nograx/ioBroker.zendure-solarflow/main/admin/zendure-solarflow.png",
    "readme": "https://github.com/nograx/ioBroker.zendure-solarflow/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "energy",
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "adminUI": {
      "config": "materialize"
    },
    "eraseOnUpload": true,
    "dependencies": [
      {
        "js-controller": ">=3.3.22"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.0.0"
      }
    ]
  },
  "native": {
    "username": ""
  },
  "encryptedNative": [
    "password"
  ],
  "protectedNative": [
    "password"
  ],
  "objects": [],
  "instanceObjects": []
}
