{
  "common": {
    "name": "zendure-solarflow",
    "version": "1.9.2",
    "news": {
      "1.9.2": {
        "en": "Fix state some definitions",
        "de": "Einige Definitionen festlegen",
        "ru": "Установить некоторые определения",
        "pt": "Corrigir estado algumas definições",
        "nl": "Fix geeft enkele definities",
        "fr": "Fixer les définitions",
        "it": "Fissare lo stato alcune definizioni",
        "es": "Determinar el estado algunas definiciones",
        "pl": "Popraw niektóre definicje",
        "uk": "Виправлення стану деяких визначення",
        "zh-cn": "修正一些定义"
      },
      "1.9.1": {
        "en": "Improvement for 'Low Voltage Block'.\nChanged the state \"hubState\" a an option value.",
        "de": "Verbesserung für 'Low Voltage Block'.\nÄnderte den Zustand \"hubState\" einen Optionswert.",
        "ru": "Улучшение «Low Voltage Block».\nИзменил государственную «hubState» как альтернативную стоимость.",
        "pt": "Melhoria para \"Low Voltage Block\".\nAlterou o estado \"hubState\" um valor de opção.",
        "nl": "Verbetering voor 'Low Voltage Block'.\nVeranderde de status \"hubState\" een optiewaarde.",
        "fr": "Amélioration pour 'Block basse tension'.\nChangement de l'état \"hubState\" une valeur d'option.",
        "it": "Miglioramento per 'Low Tension Block'.\nCambiato lo stato \"hubState\" un valore di opzione.",
        "es": "Mejora para 'Low Voltage Block'.\nCambió el estado \"hubState\" un valor de opción.",
        "pl": "Poprawa dla \"bloku niskiego napięcia\".\nZmieniła wartość opcji państwa \"hubState\".",
        "uk": "Удосконалення для блоку напруги \"Low\".\nЗмінено стан \"hubState\" варіант значення.",
        "zh-cn": "改进\"低伏特格\".\n更改州\"hubstate\"为选项值."
      },
      "1.9.0": {
        "en": "New option to force Solarflow device to go offline when \"Low Voltage Block\"-option is used.",
        "de": "Neue Option, Solarflow-Gerät zu zwingen, offline zu gehen, wenn \"Low Voltage Block\"-Option verwendet wird.",
        "ru": "Новая опция заставить устройство Solarflow выйти в автономном режиме, когда используется опция «Low Voltage Block».",
        "pt": "Nova opção para forçar o dispositivo Solarflow a ficar offline quando a opção \"Low Voltage Block\" é usada.",
        "nl": "Nieuwe optie om Solarflow apparaat te dwingen offline te gaan wanneer \"Low Voltage Blok\"-optie wordt gebruikt.",
        "fr": "Nouvelle option pour forcer le périphérique Solarflow à déconnecter lorsque l'option \"Block basse tension\" est utilisée.",
        "it": "Nuova opzione per forza dispositivo Solarflow per andare offline quando \"Low Tensione Block\"-opzione è utilizzato.",
        "es": "Nueva opción para forzar el dispositivo Solarflow a salir fuera de línea cuando se utiliza la opción \"Low Voltage Block\".",
        "pl": "Nowa opcja zmuszenia urządzenia Solarflow do offline przy użyciu opcji \"Block niskiego napięcia\".",
        "uk": "Використовується новий варіант для відключення пристроїв Solarflow при \"Low Блок напруги\"-опція.",
        "zh-cn": "使用“ Low Voltage Block”- 选项时, 强制 Solarflow 设备下线的新选项 ."
      },
      "1.8.8": {
        "en": "Improve connection retry, expand the time with every retry attempt.\nStart \"restart adapter job\" regardless of connection.\nFix Hyper setInputLimit with step",
        "de": "Verbessern Sie die Retry-Verbindung, erweitern Sie die Zeit mit jedem Retry-Test.\nStarten Sie \"Adapter Job starten\" unabhängig von der Verbindung.\nFix Hyper setInputLimit mit Schritt",
        "ru": "Улучшите восстановление связи, расширяйте время с каждой попыткой возврата.\nНачните работу «перезапуска адаптера» независимо от подключения.\nFix Hyper setInputLimit с шагом",
        "pt": "Melhore a retificação da conexão, expanda o tempo com cada tentativa de retificação.\nComece \"reiniciar o trabalho do adaptador\" independentemente da conexão.\nFix Hyper setInputLimit com passo",
        "nl": "Verbeter de verbinding opnieuw proberen, breidt de tijd met elke retry poging.\nStart \"herstart adaptertaak\" ongeacht de verbinding.\nRepareren Hyper setInputLimit met stap",
        "fr": "Améliorer la connexion réessayer, étendre le temps avec chaque tentative de réessayer.\nCommencez \"redémarrer le travail d'adaptateur\" indépendamment de la connexion.\nCorrection Hyper setInputLimit avec étape",
        "it": "Migliorare la retry di connessione, espandere il tempo con ogni tentativo di riprovazione.\nAvviare \"riavviare il lavoro adattatore\" indipendentemente dalla connessione.\nFissare Hyper setInputLimit con passo",
        "es": "Mejorar la reingresación de conexión, ampliar el tiempo con cada intento de reingreso.\nComience \"trabajo adaptador de reinicio\" independientemente de la conexión.\nFijar Hyper setInputLimit con paso",
        "pl": "Ulepszenie retry połączenia, rozszerzenie czasu z każdej próby retry.\nUruchom \"ponowne uruchomienie pracy adaptera\" niezależnie od połączenia.\nFix Hyper settInputLimit z krokiem",
        "uk": "Покращити з'єднання птиця, розширити час при кожній спробі птиця.\nПочати роботу адаптера, незалежно від підключення.\nФіксація Hyper setInputLimit з кроком",
        "zh-cn": "改进连接重试, 每次重试都会延长时间 .\n开始\"重新启动适配器任务\",无论连接与否.\n以步骤修正超程序设置"
      },
      "1.8.7": {
        "en": "Fix missing control states for AIO",
        "de": "Fehlende Kontrollzustände für AIO behoben",
        "ru": "Исправление недостающих состояний управления для AIO",
        "pt": "Corrigir estados de controle ausentes para AIO",
        "nl": "Fix ontbrekende controlestaten voor AIO",
        "fr": "Correction des états de contrôle manquants pour AIO",
        "it": "Fissare gli stati di controllo mancanti per AIO",
        "es": "Fijar estados de control perdidos para AIO",
        "pl": "Napraw brakujące stany kontroli dla AIO",
        "uk": "Виправлення відсутніх контрольних станів для AIO",
        "zh-cn": "为 AIO 修复缺失的控制状态"
      },
      "1.8.6": {
        "en": "Change login method: Added a retry loop for connecting to Zendure Cloud, if the Cloud Service \"hangs\" or is not available it will retry the connection 3 times.",
        "de": "Login-Methode ändern: Hinzugefügt eine Retry-Loop für die Verbindung mit Zendure Cloud, wenn der Cloud Service \"Ändert\" oder nicht verfügbar ist, wird es die Verbindung 3 mal wiederherzustellen.",
        "ru": "Изменение метода входа: Добавлена петля для подключения к Zendure Cloud, если облачная служба «висит» или недоступна, она перепробует соединение 3 раза.",
        "pt": "Alterar método de login: Adicionado um loop de retificação para se conectar ao Zendure Cloud, se o serviço de nuvem \"hangs\" ou não está disponível ele vai retenta a conexão 3 vezes.",
        "nl": "Aanmeldmethode wijzigen: Een retry-lus toegevoegd om verbinding te maken met Zendure Cloud, als de Cloud Service \"hangt\" of niet beschikbaar is, zal het de verbinding 3 keer opnieuw proberen.",
        "fr": "Modifier la méthode de connexion & #160;: Ajout d'une boucle de réessayer pour se connecter à Zendure Cloud, si le service Cloud \"hangs\" ou n'est pas disponible, il réessayera la connexion 3 fois.",
        "it": "Modifica del metodo di login: Aggiunto un loop di riprovazione per il collegamento a Zendure Cloud, se il servizio cloud \"impicca\" o non è disponibile, riproverà la connessione 3 volte.",
        "es": "Cambiar método de inicio de sesión: Se agregó un bucle de reingreso para conectarse a Zendure Cloud, si el Servicio Cloud \"hangs\" o no está disponible, volverá a iniciar la conexión 3 veces.",
        "pl": "Zmień metodę logowania: Dodano pętlę ponowną do podłączenia do Zharb Cloud, jeśli Cloud Service \"zawiśnie\" lub nie jest dostępna, ponownie wypróbuje połączenie 3 razy.",
        "uk": "Спосіб зміни логіки: Додана птиця петля для підключення до Zendure Cloud, якщо Хмарна служба \"хвишки\" або не доступна вона буде переробляти з'єднання 3 рази.",
        "zh-cn": "更改登录方法 : 添加了连接到 Zendure 云的重试循环, 如果云服务“ hangs” 或无法使用, 它将重试连接三次 ."
      },
      "1.8.5": {
        "en": "Fix missing states for new HUB Firmware when connected to ACE\nFix corrent max value for AIO",
        "de": "Fix fehlende Zustände für neue HUB Firmware, wenn mit ACE verbunden\nKorrent max Wert für AIO festsetzen",
        "ru": "Исправление недостающих состояний для нового HUB Firmware при подключении к ACE\nМакс. значение для AIO",
        "pt": "Corrigir estados ausentes para novo HUB Firmware quando conectado à ACE\nCorrigir o valor máximo correspondente para AIO",
        "nl": "Fix ontbrekende toestanden voor nieuwe HUB Firmware wanneer aangesloten op ACE\nFix corresponderende maximale waarde voor AIO",
        "fr": "Correction des états manquants pour le nouveau micrologiciel HUB lorsqu'il est connecté à ACE\nFixe la valeur maximale corrente pour AIO",
        "it": "Fissare gli stati mancanti per il nuovo firmware HUB quando collegato ad ACE\nCorrente di fissaggio del valore massimo per AIO",
        "es": "Fijar estados perdidos para el nuevo HUB Firmware cuando conectado a ACE\nValor máximo corregido para AIO",
        "pl": "Naprawianie brakujących stanów dla nowego oprogramowania HUB po podłączeniu do ACE\nPopraw maksymalną wartość corrent dla AIO",
        "uk": "Виправлення відсутніх штатів для прошивки HUB при підключенні до ACE\nФіксувати коструктивне значення для AIO",
        "zh-cn": "连接到 ACE 时将新 HUB 固件状态修复为缺失状态\n修正 AIO 的最大同位素值"
      }
    },
    "titleLang": {
      "en": "Zendure Solarflow",
      "de": "Zendure Solarflow",
      "ru": "Зендуре Соларфлоу",
      "pt": "Zendure Solarflow",
      "nl": "Zendure Solarflow",
      "fr": "Flux solaire Zendure",
      "it": "Zendur Solarflow",
      "es": "Zendure Solarflow",
      "pl": "Zendure Solarflow",
      "uk": "Zendure Solarflow",
      "zh-cn": "Zendure Solarflow"
    },
    "desc": {
      "en": "zendure-solarflow",
      "de": "Zendure-Solarflow",
      "ru": "Zendure-Solarflow",
      "pt": "zendure-solarflow",
      "nl": "zendure-solarflow",
      "fr": "zendure-solarflow",
      "it": "zendure-solarflow",
      "es": "flujo-solar-zendure",
      "pl": "zendure-solarflow",
      "uk": "zendure-solarflow",
      "zh-cn": "zendure-solarflow"
    },
    "authors": [
      "Peter <peter.frommert@outlook.com>"
    ],
    "keywords": [
      "Zendure",
      "Solarflow"
    ],
    "licenseInformation": {
      "license": "GPL-3.0-only",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "icon": "zendure-solarflow.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/nograx/ioBroker.zendure-solarflow/main/admin/zendure-solarflow.png",
    "readme": "https://github.com/nograx/ioBroker.zendure-solarflow/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "energy",
    "tier": 2,
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "adminUI": {
      "config": "materialize"
    },
    "eraseOnUpload": true,
    "dependencies": [
      {
        "js-controller": ">=5.0.19"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.0.0"
      }
    ]
  },
  "native": {
    "userName": "",
    "server": "global",
    "useCalculation": false,
    "useLowVoltageBlock": false,
    "dischargeLimit": 10
  },
  "encryptedNative": [
    "password"
  ],
  "protectedNative": [
    "password"
  ],
  "objects": [],
  "instanceObjects": []
}
