{
  "common": {
    "name": "zendure-solarflow",
    "version": "1.2.4",
    "news": {
      "1.2.4": {
        "en": "Use setInterval instead of cronjob for refreshing access token",
        "de": "Verwenden Sie setInterval anstelle von cronjob für den erfrischenden Zugang zuken",
        "ru": "Использовать setInterval вместо cronjob для обновления токена доступа",
        "pt": "Use setInterval em vez de cronjob para atualizar o token de acesso",
        "nl": "Gebruik setInterval in plaats van cronjob voor verfrissende toegang token",
        "fr": "Utiliser setInterval au lieu de cronjob pour rafraîchir l'accès jeton",
        "it": "Utilizzare setInterval invece di cronjob per rinfrescare l'accesso token",
        "es": "Use setInterval en lugar de cronjob para el acceso refrescante token",
        "pl": "Użyj setInterval zamiast cronjob do odświeżania token dostępu",
        "uk": "Використовуйте setInterval замість cronjob для оновлення доступу token",
        "zh-cn": "使用设置 Interval 而非 cronjob 来刷新访问符"
      },
      "1.2.3": {
        "en": "Fix ACK on onStateChange\nUpdate Readme",
        "de": "Reparieren Sie ACK auf onState Veränderung\nUpdate Reader",
        "ru": "Fix ACK onState Изменение\nReadme",
        "pt": "Fix ACK onState Variação\nAtualizar o Readme",
        "nl": "Fix ACK op onState Verschil\nReadme bijwerken",
        "fr": "Correction de l'ACK sur l'état Changement\nMettre à jour Readme",
        "it": "Riparare il back suState Cambiamento\nAggiornamento",
        "es": "Arregla el estado Cambio\nActualización Readme",
        "pl": "Napraw ACK w stanie Zmiana\nAktualizacja Readme",
        "uk": "Виправлення ACK на onState Зареєструватися\nОновлення Readme",
        "zh-cn": "在状态上修复ACK 变动\n更新读取器"
      },
      "1.2.2": {
        "en": "Fix issue that renamed devices could not be found.\nAdd states for name, product name, serial ID and configured server.\nMake \"energyWhMax\" State writable, so you can adjust the max Value.\nSent a warning if a device is configured for a server not in use.",
        "de": "Problem behoben, dass umbenannte Geräte nicht gefunden werden konnten.\nFügen Sie Zustände für Name, Produktname, Serien-ID und konfigurierten Server hinzu.\nMachen Sie \"energyWhMax\" Zustand schreibbar, so können Sie den Maximalwert anpassen.\nGesendet eine Warnung, wenn ein Gerät für einen nicht im Einsatz befindlichen Server konfiguriert ist.",
        "ru": "Исправьте проблему, которую переименованные устройства не удалось найти.\nДобавить состояния для имени, имени продукта, последовательного идентификатора и настроенного сервера.\nСделайте состояние «energyWhMax» действительным, так что вы можете настроить максимальное значение.\nОтправить предупреждение, если устройство настроено для сервера, не используемого.",
        "pt": "Corrigir problema que os dispositivos renomeados não poderiam ser encontrados.\nAdicione estados para nome, nome do produto, ID serial e servidor configurado.\nFaça \"energyWhMax\" Estado writable, para que você possa ajustar o valor máximo.\nEnvia um aviso se um dispositivo estiver configurado para um servidor não estiver em uso.",
        "nl": "Fix probleem dat hernoemde apparaten kon niet worden gevonden.\nVoeg statuss toe voor naam, productnaam, seriële ID en geconfigureerde server.\nMaak \"energyWhMax\" staat beschrijfbaar, zodat u de maximale waarde kunt aanpassen.\nVerzonden een waarschuwing als een apparaat is geconfigureerd voor een server die niet in gebruik is.",
        "fr": "Correction d'un problème qui a été rebaptisé dispositifs ne pouvait pas être trouvé.\nAjouter des états pour le nom, le nom du produit, l'ID série et le serveur configuré.\nFaire \"energyWhMax\" État enregistrable, de sorte que vous pouvez ajuster la valeur maximale.\nEnvoyer un avertissement si un périphérique est configuré pour un serveur non utilisé.",
        "it": "Risolvere il problema che i dispositivi ribattezzati non potrebbero essere trovati.\nAggiungi stati per nome, nome del prodotto, ID seriale e server configurato.\nRendere \"energyWhMax\" Stato scrivibile, in modo da poter regolare il valore massimo.\nInviare un avviso se un dispositivo è configurato per un server non in uso.",
        "es": "Fijar el problema que no se pueden encontrar dispositivos renombrados.\nAñadir estados para nombre, nombre de producto, ID de serie y servidor configurado.\nHacer \"energíaWhMax\" estado writable, por lo que puede ajustar el valor máximo.\nEnviamos una advertencia si un dispositivo está configurado para un servidor que no está en uso.",
        "pl": "Naprawiono problem, że nie można było znaleźć przemianowanych urządzeń.\nDodaj stany nazwy, nazwy produktu, seryjnego identyfikatora i skonfigurowanego serwera.\nDodać \"energyWhMax\" Stan zapisywalny, dzięki czemu można dostosować wartość max.\nWysłał ostrzeżenie, jeśli urządzenie jest skonfigurowane dla serwera, który nie jest używany.",
        "uk": "Виправлення проблеми, які не можуть бути знайдені пристрої.\nДодайте штати для імені, назви товару, послідовний ідентифікатор і налаштований сервер.\nЗробіть \"енергетикаWhMax\" Держава, тому ви можете регулювати максимальну вартість.\nУвімкніть попередження, якщо пристрій налаштовано на сервер не у використанні.",
        "zh-cn": "无法找到重命名的设备 .\n添加名称、产品名称、序列ID和配置服务器的状态 .\n让“ energyWhMax” 状态可写入, 这样您就可以调整最大值 .\n如果为服务器配置了设备, 则发送警告 ."
      },
      "1.2.1": {
        "en": "Fix calculation of soc: Set energyMaxWh to current energyWh if Zendures SOC is 100%\nRound SOC to max 1 digit after comma.",
        "de": "Berechnung von soc: Energie einstellenMaxWh zur aktuellen Energie Wh, wenn Zendures SOC 100%\nRunder SOC bis max 1 Ziffer nach Komma.",
        "ru": "Исправление расчета сока: Установка энергииMaxWh к текущей энергии В, если Зендурес SOC составляет 100%\nКруглый SOC до макс. 1 цифры после запятой.",
        "pt": "Cálculo fixo do soc: Definir energia MaxWh para energia atual Wh se Zendures SOC é 100%\nSOC redondo para max 1 dígito após vírgula.",
        "nl": "Fix calculation of soc: Energie instellenMaxWh op huidige energie Als Zendures SOC 100% is\nRonde SOC tot maximaal 1 cijfer na komma.",
        "fr": "Fixez le calcul du soc: Définir l'énergieMaxWh à l'énergie actuelle Whh si Zendures SOC est 100%\nRond SOC à 1 chiffre maximum après virgule.",
        "it": "Fissare il calcolo del soc: Impostare energia MaxWh a energia corrente Se Zendures SOC è 100%\nSOC tondo a max 1 cifra dopo virgola.",
        "es": "Fijar el cálculo del soc: Establecer energíaMaxWh a la energía actual Wh si Zendures SOC es 100%\nSOC redondo a máx 1 dígito después del coma.",
        "pl": "Fix obliczenia soc: Ustaw energyMaxWh na energię bieżącą Wh jeśli Zendures SOC wynosi 100%\nOkrągłe SOC do maksymalnie 1 cyfry po przecinku.",
        "uk": "Фіксований розрахунок СО: Настроювання енергіїMaxWh до поточної енергії Wh, якщо Zendures SOC 100%\nКруглий SOC до макс. 1 цифра після коми.",
        "zh-cn": "索克的固定计算 : 将能量MaxWh设定为当前能量 如果Zendures SOC是100%的话\n在逗号后将 SOC 转至最大 1 位数 ."
      },
      "1.2.0": {
        "en": "EU server is working now.\nFix calculation errors in log when calculation is not used\nMore Debug Output\nFilter SolarFlow devices, so no other devices (e.g. SmartPlugs) will be added.\nClear password when settings loaded, as encrypted password is loaded into input and leads to a wrong password.",
        "de": "EU-Server arbeitet jetzt.\nBerechnungsfehler im Log behoben, wenn die Berechnung nicht verwendet wird\nMehr Debug Ausgang\nFilter Solar Durchflussgeräte, so dass keine anderen Geräte (z.B. SmartPlugs) hinzugefügt werden.\nKlares Passwort bei geladenen Einstellungen, da verschlüsseltes Passwort in Eingabe geladen wird und zu einem falschen Passwort führt.",
        "ru": "Сервер ЕС работает сейчас.\nИсправление ошибок расчета в журнале, когда не используется расчет\nMore Debug Выход\nФильтры Flow-устройства, поэтому никакие другие устройства (например, SmartPlugs) не будут добавлены.\nОчистить пароль при загрузке настроек, так как зашифрованный пароль загружается в ввод и приводит к неправильному паролю.",
        "pt": "O servidor da UE está a funcionar agora.\nCorrigir erros de cálculo no log quando o cálculo não é usado\nMais saída de depuração\nFiltro solar Dispositivos de fluxo, então nenhum outro dispositivo (por exemplo, SmartPlugs) será adicionado.\nSenha clara quando as configurações carregadas, como a senha criptografada é carregada em entrada e leva a uma senha errada.",
        "nl": "De EU-server werkt nu.\nFix rekenfouten in log wanneer berekening niet wordt gebruikt\nMeer debug-uitvoer\nFilterzonne Stroomapparaten, zodat er geen andere apparaten (bv. SmartPlugs) worden toegevoegd.\nWachtwoord wissen bij laden, aangezien versleuteld wachtwoord wordt geladen in invoer en leidt tot een verkeerd wachtwoord.",
        "fr": "Le serveur de l'UE fonctionne maintenant.\nCorrection d'erreurs de calcul dans le journal lorsque le calcul n'est pas utilisé\nPlus de sortie de débogage\nFiltre solaire Dispositifs de débit, de sorte qu'aucun autre dispositif (par exemple SmartPlugs) ne sera ajouté.\nEffacer le mot de passe lorsque les paramètres sont chargés, car le mot de passe chiffré est chargé en entrée et mène à un mauvais mot de passe.",
        "it": "Il server UE sta funzionando ora.\nFissare gli errori di calcolo nel registro quando il calcolo non viene utilizzato\nPiù Debug Output\nFiltro solare I dispositivi di flusso, quindi non verranno aggiunti altri dispositivi (ad esempio SmartPlugs).\nCancella password quando le impostazioni vengono caricate, poiché la password crittografata viene caricata in ingresso e porta a una password sbagliata.",
        "es": "El servidor de la UE está trabajando ahora.\nFijar errores de cálculo en el registro cuando el cálculo no se utiliza\nMás Debug Output\nFiltro solar Dispositivos de flujo, por lo que no se añadirán otros dispositivos (por ejemplo, SmartPlugs).\nContraseña clara cuando se cargan los ajustes, ya que la contraseña cifrada se carga en entrada y conduce a una contraseña incorrecta.",
        "pl": "Serwer UE działa.\nPopraw błędy obliczeniowe w dzienniku, gdy obliczenia nie są używane\nWięcej wyników debugowania\nFiltr słoneczny Urządzenia przepływowe, więc nie będą dodawane żadne inne urządzenia (np. SmartPlugs).\nWyczyść hasło podczas wczytywania ustawień, ponieważ szyfrowane hasło jest wczytywane do wejścia i prowadzi do błędnego hasła.",
        "uk": "Сервер ЄС працює зараз.\nВиправлення помилок розрахунку в журналі при розрахунку не використовується\nДетальніше Debug Вихід\nФільтр Сонячний Пристрої потоку, тому не будуть додані інші пристрої (наприклад, SmartPlugs).\nОчистити пароль при навантаженні налаштувань, як зашифрований пароль завантажується в вхід і призводить до неправильного пароля.",
        "zh-cn": "欧盟服务器正在工作.\n不使用计算时纠正日志中的计算错误\n更多调试输出\n过滤太阳 流设备,所以不会添加其他设备(如SmartPlugs).\n装入设置时清除密码, 因为加密密码被装入输入, 并导致错误的密码 ."
      },
      "1.1.23": {
        "en": "Fix calculation of \"energy in batteries\"\nTry to implement EU server - untested -",
        "de": "Fixe Berechnung von \"Energie in Batterien\"\nVersuchen Sie, EU-Server zu implementieren - nicht getestet -",
        "ru": "Исправленный расчет «энергии в батареях»\nПопробуйте реализовать сервер ЕС - непроверенный -",
        "pt": "Cálculo fixo de \"energia em baterias\"\nTente implementar servidor da UE - não testado -",
        "nl": "Berekening van \"energie in batterijen\"\nProbeer de EU-server te implementeren - niet getest -",
        "fr": "Correction du calcul de \"l'énergie dans les batteries\"\nEssayez de mettre en œuvre le serveur UE - non testé -",
        "it": "Fissare il calcolo di \"energia nelle batterie\"\nCerca di implementare il server UE - non testato -",
        "es": "Cálculo de \"energía en baterías\"\nTrate de implementar el servidor de la UE - sin probar -",
        "pl": "Napraw obliczanie \"energii w bateriach\"\nSpróbuj wdrożyć serwer UE - nieprzetestowany -",
        "uk": "Фіксований розрахунок \"енергетики в батареях\"\nСпробуйте реалізувати сервер ЄС - не перевірено -",
        "zh-cn": "固定“电池中的能量”的计算\n尝试执行 EU 服务器 - 未测试 -"
      },
      "1.1.22": {
        "en": "Try to fix reset values at midnight",
        "de": "Versuchen Sie, Reset-Werte um Mitternacht zu beheben",
        "ru": "Попробуйте исправить значения сброса в полночь",
        "pt": "Tente corrigir valores de reset à meia-noite",
        "nl": "Probeer resetwaarden om middernacht te repareren",
        "fr": "Essayez de fixer les valeurs de réinitialisation à minuit",
        "it": "Prova a correggere i valori di reset a mezzanotte",
        "es": "Trate de fijar valores de reset a medianoche",
        "pl": "Spróbuj naprawić wartości reset o północy",
        "uk": "Спробуйте виправити значення скидання на ніч",
        "zh-cn": "尝试在午夜修复重置值"
      }
    },
    "title": "Zendure Solarflow",
    "titleLang": {
      "en": "Zendure Solarflow",
      "de": "Zendure Solarflow",
      "ru": "Зендуре Соларфлоу",
      "pt": "Zendure Solarflow",
      "nl": "Zendure Solarflow",
      "fr": "Flux solaire Zendure",
      "it": "Zendur Solarflow",
      "es": "Zendure Solarflow",
      "pl": "Zendure Solarflow",
      "uk": "Zendure Solarflow",
      "zh-cn": "Zendure Solarflow"
    },
    "desc": {
      "en": "zendure-solarflow",
      "de": "Zendure-Solarflow",
      "ru": "Zendure-Solarflow",
      "pt": "zendure-solarflow",
      "nl": "zendure-solarflow",
      "fr": "zendure-solarflow",
      "it": "zendure-solarflow",
      "es": "flujo-solar-zendure",
      "pl": "zendure-solarflow",
      "uk": "zendure-solarflow",
      "zh-cn": "zendure-solarflow"
    },
    "authors": [
      "Peter <peter.frommert@outlook.com>"
    ],
    "keywords": [
      "Zendure",
      "Solarflow"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "main": "build/main.js",
    "icon": "zendure-solarflow.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/nograx/ioBroker.zendure-solarflow/main/admin/zendure-solarflow.png",
    "readme": "https://github.com/nograx/ioBroker.zendure-solarflow/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "energy",
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "adminUI": {
      "config": "materialize"
    },
    "eraseOnUpload": true,
    "dependencies": [
      {
        "js-controller": ">=3.3.22"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.0.0"
      }
    ]
  },
  "native": {
    "userName": "",
    "server": "global",
    "useCalculation": false,
    "useLowVoltageBlock": false
  },
  "encryptedNative": [
    "password"
  ],
  "protectedNative": [
    "password"
  ],
  "objects": [],
  "instanceObjects": []
}
