{
  "common": {
    "name": "zendure-solarflow",
    "version": "1.15.0",
    "news": {
      "1.15.0": {
        "en": "Add 'packPower' state, which shows combined power from (packInputPower and outputPackPower). Discharging will be shown with a negative value.\nAdd 'hyperTmp' to Solarflow 800 devices in hope this will show the temperature of the Solarflow 800 (can not test it due to lack of test device).",
        "de": "Fügen Sie 'packPower' Zustand hinzu, der kombinierte Leistung von (packInputPower und outputPackPower) zeigt. Das Abladen wird mit einem negativen Wert angezeigt.\nFügen Sie 'hyperTmp' zu Solarflow 800 Geräten in der Hoffnung, dies zeigt die Temperatur des Solarflow 800 (kann nicht testen, es aufgrund fehlender Testvorrichtung).",
        "ru": "Добавьте состояние «packPower», которое показывает комбинированную мощность от (packInputPower и outputPackPower). Разрядка будет показана с отрицательным значением.\nДобавьте «гиперTmp» в устройства Solarflow 800 в надежде, что это покажет температуру Solarflow 800 (не может проверить его из-за отсутствия тестового устройства).",
        "pt": "Adicione o estado 'packPower', que mostra potência combinada de (packInputPower e saídaPackPower). O descarregamento será mostrado com um valor negativo.\nAdicione 'hyperTmp' aos dispositivos Solarflow 800 na esperança de que isso mostre a temperatura do Solarflow 800 (não pode testá-lo devido à falta de dispositivo de teste).",
        "nl": "Voeg 'packPower' staat, die gecombineerde kracht toont van (packInputPower en outputPackPower). Uitladen zal worden getoond met een negatieve waarde.\nVoeg 'hyperTmp' toe aan Solarflow 800 apparaten in de hoop dat dit de temperatuur van de Solarflow 800 zal tonen (kan het niet testen door gebrek aan testapparaat).",
        "fr": "Ajouter l'état \"packPower\", qui affiche la puissance combinée de (packInputPower et sortiePackPower). La charge sera affichée avec une valeur négative.\nAjouter 'hyperTmp' aux appareils Solarflow 800 dans l'espoir que cela montrera la température du Solarflow 800 (ne peut pas le tester en raison de l'absence de dispositif d'essai).",
        "it": "Aggiungi 'packPower' stato, che mostra potenza combinata da (packInputPower e outputPackPower). La scarica sarà mostrata con un valore negativo.\nAggiungi 'hyperTmp' a Solarflow 800 dispositivi nella speranza che questo mostrerà la temperatura del Solarflow 800 (non può testarlo a causa della mancanza di dispositivo di prova).",
        "es": "Añadir 'packPower' estado, que muestra la potencia combinada de (packInputPower y salidaPackPower). La descarga se mostrará con un valor negativo.\nAñadir 'hiperTmp' a Solarflow 800 dispositivos con la esperanza de que esto muestre la temperatura del flujo solar 800 (no puede probarlo debido a la falta de dispositivo de prueba).",
        "pl": "Dodać stan 'packPower', który pokazuje łączną moc z (packInputPower i outputPackPower). Wyładowanie zostanie pokazane z wartością ujemną.\nDodać 'hiperTmp' do urządzeń Solarflow 800 w nadziei, że pokaże to temperaturę Solarflow 800 (nie można go przetestować z powodu braku urządzenia testowego).",
        "uk": "Додати стан \"packPower\", який показує комбіновану потужність з (packInputPower і вихідPackPower). Відхилення буде показано з негативним значенням.\nДодати \"гіперTmp\" до пристроїв Solarflow 800 надії, це покаже температуру Solarflow 800 (не можна перевірити це через відсутність тестового пристрою).",
        "zh-cn": "添加“ packPower” 状态, 显示来自( pack InputPower 和 输出 PackPower ) 的综合电源 。 充电将以负值显示 .\n在 Solarflow 800 设备中添加“ hyperTmp” , 希望这将显示 Solarflow 800 的温度( 由于缺乏测试设备, 无法测试) ."
      },
      "1.14.4": {
        "en": "Add Product Key for Solarflow 800\nUpdate dependencys",
        "de": "Produktschlüssel für Solarflow 800 hinzufügen\nAktualisieren von Abhängigkeiten",
        "ru": "Добавить ключ продукта для Solarflow 800\nОбновление зависимостей",
        "pt": "Adicionar chave de produto para Solarflow 800\nAtualizar dependências",
        "nl": "Productsleutel voor Solarflow 800 toevoegen\nAfhankelijkheden bijwerken",
        "fr": "Ajouter une clé de produit pour Solarflow 800\nMettre à jour les dépendances",
        "it": "Aggiungi la chiave del prodotto per Solarflow 800\nDipendenze di aggiornamento",
        "es": "Añadir Clave de producto para el flujo solar 800\nActualizar las dependencias",
        "pl": "Dodaj klucz produktu dla Solarflow 800\nUaktualnianie zależności",
        "uk": "Додати ключ продукту для Solarflow 800\nОновлення залежності",
        "zh-cn": "添加太阳流800的产品密钥\n更新依赖关系"
      },
      "1.14.3": {
        "en": "Fix input and output limit for Solarflow 2400 AC",
        "de": "Feste Eingangs- und Ausgangsgrenze für Solarflow 2400 AC",
        "ru": "Установить предел ввода и вывода для Solarflow 2400 AC",
        "pt": "Fix input and output limit for Solarflow 2400 AC",
        "nl": "Fix ingang en output limiet voor Solarflow 2400 AC",
        "fr": "Fixer la limite d'entrée et de sortie pour Solarflow 2400 AC",
        "it": "Limite di ingresso e uscita per Solarflow 2400 AC",
        "es": "Fijar el límite de entrada y salida para el flujo solar 2400 AC",
        "pl": "Granica wejścia i wyjścia dla Solarflow 2400 AC",
        "uk": "Фіксований вхід і вихідний ліміт для Solarflow 2400 AC",
        "zh-cn": "修正太阳流2400 AC的输入和输出限制"
      },
      "1.14.2": {
        "en": "Fix control states not writable.",
        "de": "Kontrollzustände nicht schreibbar reparieren.",
        "ru": "Установить контрольные состояния, не подлежащие написанию.",
        "pt": "Corrigir estados de controle não graváveis.",
        "nl": "Regel controle staten niet schrijfbaar.",
        "fr": "Fixez les états de contrôle qui ne sont pas lisibles.",
        "it": "Fissare gli stati di controllo non scrivibile.",
        "es": "Arreglar estados de control no es obligatorio.",
        "pl": "Naprawa stanów kontroli nie jest możliwa do zapisu.",
        "uk": "Виправлення контрольних станів не дратуються.",
        "zh-cn": "修复控制状态不可写入 ."
      },
      "1.14.1": {
        "en": "IMPORTANT: This version will use a new way to check which states should be created for the device, so maybe something is broken on state creation!\nAdd support for AC2400, Solarflow 800 and Solarflow 800 Pro. All devices are untested as Zendure won't allow to share data to other users on these new devices AND I don't own any of the devices!\nRemoved the \"standby usage\" on batteries, as it confused some people.",
        "de": "WICHTIG: Diese Version wird einen neuen Weg verwenden, um zu überprüfen, welche Zustände für das Gerät erstellt werden sollten, also ist vielleicht etwas auf die staatliche Schöpfung gebrochen!\nUnterstützung für AC2400, Solarflow 800 und Solarflow 800 Pro. Alle Geräte sind nicht getestet, da Zendure nicht zulassen wird, Daten an andere Benutzer auf diesen neuen Geräten zu teilen und ich habe keine der Geräte!\nEntfernt die \"Standby-Nutzung\" auf Batterien, da es einige Leute verwirrt.",
        "ru": "Эта версия будет использовать новый способ проверки того, какие состояния должны быть созданы для устройства, поэтому, возможно, что-то сломано на создании состояния!\nДобавить поддержку AC2400, Solarflow 800 и Solarflow 800 Pro. Все устройства не тестируются, поскольку Zendure не позволяет делиться данными с другими пользователями на этих новых устройствах!\nСнято \"употребление в режиме ожидания\" на батареях, так как это смутило некоторых людей.",
        "pt": "IMPORTANTE: Esta versão usará uma nova maneira de verificar quais estados devem ser criados para o dispositivo, então talvez algo esteja quebrado na criação do estado!\nAdicione suporte para AC2400, Solarflow 800 e Solarflow 800 Pro. Todos os dispositivos não são testados como Zendure não permitirá compartilhar dados para outros usuários nestes novos dispositivos E eu não possuo nenhum dos dispositivos!\nRemovido o \"uso de espera\" nas baterias, pois confundiu algumas pessoas.",
        "nl": "BELANGRIJK: Deze versie zal een nieuwe manier gebruiken om te controleren welke staten voor het apparaat gemaakt moeten worden, dus misschien is er iets gebroken bij het aanmaken van de staat!\nVoeg ondersteuning toe voor AC2400, Solarflow 800 en Solarflow 800 Pro. Alle apparaten zijn niet getest als Zendure zal niet toestaan om gegevens te delen met andere gebruikers op deze nieuwe apparaten en ik bezit geen van de apparaten!\nVerwijderde de \"standby gebruik\" op batterijen, omdat het verward sommige mensen.",
        "fr": "IMPORTANT: Cette version utilisera une nouvelle façon de vérifier quels états devraient être créés pour l'appareil, donc peut-être quelque chose est cassé sur la création d'état!\nAjoutez le support pour AC2400, Solarflow 800 et Solarflow 800 Pro. Tous les appareils ne sont pas testés car Zendure ne permettra pas de partager des données avec d'autres utilisateurs sur ces nouveaux appareils ET je ne possède aucun des appareils!\nSupprimé l'\"utilisation en attente\" sur les batteries, car il a confondu certaines personnes.",
        "it": "IMPORTANTE: Questa versione userà un nuovo modo per controllare quali stati dovrebbero essere creati per il dispositivo, quindi forse qualcosa è rotto sulla creazione dello stato!\nAggiungi supporto per AC2400, Solarflow 800 e Solarflow 800 Pro. Tutti i dispositivi non sono testati come Zendure non permetterà di condividere i dati ad altri utenti su questi nuovi dispositivi E non possiedo alcuno dei dispositivi!\nRimuoveto il \"standby use\" sulle batterie, in quanto confuso alcune persone.",
        "es": "IMPORTANTE: Esta versión utilizará una nueva manera de comprobar qué estados deben ser creados para el dispositivo, así que tal vez algo está roto en la creación del estado!\nAñadir soporte para AC2400, Solarflow 800 y Solarflow 800 Pro. Todos los dispositivos no son probados ya que Zendure no permitirá compartir datos a otros usuarios en estos nuevos dispositivos ¡Y no tengo ninguno de los dispositivos!\nQuitó el \"uso estándar\" en las baterías, ya que confundió a algunas personas.",
        "pl": "WAŻNE: Ta wersja użyje nowego sposobu, aby sprawdzić, które stany powinny być utworzone dla urządzenia, więc może coś jest zepsute na tworzenie stanu!\nDodaj wsparcie dla AC2400, Solarflow 800 i Solarflow 800 Pro. Wszystkie urządzenia są nietestowane, ponieważ Zhand nie pozwala udostępniać danych innym użytkownikom na tych nowych urządzeniach i nie jestem właścicielem żadnego z urządzeń!\nUsunięto \"tryb czuwania\" na bateriach, ponieważ to myliło niektórych ludzi.",
        "uk": "ВАЖЛИВО: Ця версія буде використовувати новий спосіб перевірки стану, який повинен бути створений для пристрою, тому, можливо, щось зламане на державному створенні!\nДодавання підтримки AC2400, Solarflow 800 та Solarflow 800 Pro. Всі пристрої не перевірені як Zendure не дозволяють ділитися даними іншим користувачам на цих нових пристроях і не власними пристроями!\nЗняти \"розумне використання\" на батареях, так як він плутав деяких людей.",
        "zh-cn": "ImportANT:这个版本将使用一种新的方法来检查哪些状态应该为设备创建,所以也许有些东西在状态创建上被打破了!\n添加支持AC2400,太阳流800和太阳流800 Pro. 所有设备都未经测试,因为Zendure不允许在这些新设备上与其他用户共享数据,而且我也没有任何设备!\n取消了电池上的\"备用用量\",因为它使一些人感到困惑."
      },
      "1.13.1": {
        "en": "TEST: Set Smart CT Mode and Smart Matching Mode correctly - Feedback needed!\nRemoved efficiency from calculation, as it seems Zendure already included it in charge and discharge values",
        "de": "TEST: Setzen Sie Smart CT Modus und Smart Matching Modus richtig - Feedback erforderlich!\nEntzogene Effizienz von der Berechnung, wie es scheint, Zendure bereits in die Gebühren- und Entladewerte enthalten",
        "ru": "TEST: Установите режим Smart CT и режим Smart Matching правильно - обратная связь необходима!\nСнята эффективность с расчетов, так как, похоже, Zendure уже включила в него значения заряда и разряда",
        "pt": "TEST: Defina o modo Smart CT e o modo Smart Matching corretamente - Feedback necessário!\nEficiência removida do cálculo, pois parece que Zendure já o incluiu nos valores de carga e descarga",
        "nl": "TEST: Smart CT-modus en Smart Matching-modus correct instellen - feedback nodig!\nVerwijderde efficiëntie van de berekening, zoals het lijkt Zendure al opgenomen in de leiding en kwijting waarden",
        "fr": "ESSAI: Réglez le mode CT intelligent et le mode de correspondance intelligent correctement - Feedback nécessaire!\nEfficience supprimée du calcul, comme il semble que Zendure l'ait déjà inclus en charge et valeurs de décharge",
        "it": "TEST: Impostare la modalità Smart CT e la modalità Smart Matching correttamente - Feedback necessario!\nEfficienza eliminata dal calcolo, come sembra Zendure già incluso in carica e valori di scarico",
        "es": "TEST: Set Smart CT Mode y Smart Matching Mode correctamente - ¡Retroalimentación necesaria!\nEficiencia eliminada del cálculo, ya que parece que Zendure ya lo incluyó a cargo y valores de descarga",
        "pl": "TEST: Ustaw tryb inteligentnego CT i tryb inteligentnego dopasowywania poprawnie - wymagane informacje zwrotne!\nUsunięto wydajność z obliczeń, jak wydaje się, że Zabb już włączył go do opłat i wartości zrzutu",
        "uk": "TEST: Встановити розумний режим КТ і розумний режим матчу - Зворотній зв'язок потрібно!\nВилучена ефективність з розрахунку, так як вона здається Zendure вже включена до його заряду та значень розряду",
        "zh-cn": "TEST: 正确设置智能 CT 模式和智能匹配模式 - 需要反馈 !\n从计算中取消了效率,因为看来Zendure已经包括了它负责和排放值"
      },
      "1.13.0": {
        "en": "Add possibility to deactivate automatic restart of adapter in adapter settings (recommended only on local mode!)\nFixed missing control state \"hubState\"",
        "de": "Möglichkeit hinzufügen, den automatischen Neustart des Adapters in Adaptereinstellungen zu deaktivieren (nur im lokalen Modus eingeschaltet!)\nFester fehlender Kontrollzustand \"hubState\"",
        "ru": "Добавить возможность отключения автоматического перезапуска адаптера в настройках адаптера (рекомендуется только в локальном режиме!)\nИсправлено отсутствующее государство контроля «HubState»",
        "pt": "Adicione a possibilidade de desativar o reinício automático do adaptador nas configurações do adaptador (recomendado apenas no modo local!)\nEstado de controle ausente fixo \"hubState\"",
        "nl": "Voeg mogelijkheid toe om de automatische herstart van de adapter in adapterinstellingen te deactiveren (alleen aanbevolen op lokale modus!)\nVaste ontbrekende controlestatus \"hubState\"",
        "fr": "Ajouter la possibilité de désactiver le redémarrage automatique de l'adaptateur dans les paramètres de l'adaptateur (recommandé uniquement en mode local!)\nÉtat de contrôle manquant fixe \"hubState\"",
        "it": "Aggiungi la possibilità di disattivare il riavvio automatico dell'adattatore nelle impostazioni dell'adattatore (consigliato solo in modalità locale!)\nStato di controllo mancante fisso \"hubState\"",
        "es": "Añadir posibilidad de desactivar el reinicio automático del adaptador en la configuración del adaptador (recomendado sólo en el modo local!)\nEstado de control perdido fijo \"hubState\"",
        "pl": "Dodaj możliwość wyłączenia automatycznego restartu adaptera w ustawieniach adaptera (zalecane tylko w trybie lokalnym!)\nNaprawiono brakujący stan kontroli \"hubState\"",
        "uk": "Додайте можливість деактивувати автоматичний перезапуск адаптера в налаштуваннях адаптера (відповіли тільки на локальному режимі!)\nВиправлено відсутній контрольний стан \"hubState\"",
        "zh-cn": "添加在适配器设置中解除适配器自动重新启动的可能性( 仅在本地模式上推荐 !)\n固定缺失控制状态“ hubstate”"
      }
    },
    "titleLang": {
      "en": "Zendure Solarflow",
      "de": "Zendure Solarflow",
      "ru": "Зендуре Соларфлоу",
      "pt": "Zendure Solarflow",
      "nl": "Zendure Solarflow",
      "fr": "Flux solaire Zendure",
      "it": "Zendur Solarflow",
      "es": "Zendure Solarflow",
      "pl": "Zendure Solarflow",
      "uk": "Zendure Solarflow",
      "zh-cn": "Zendure Solarflow"
    },
    "desc": {
      "en": "zendure-solarflow",
      "de": "Zendure-Solarflow",
      "ru": "Zendure-Solarflow",
      "pt": "zendure-solarflow",
      "nl": "zendure-solarflow",
      "fr": "zendure-solarflow",
      "it": "zendure-solarflow",
      "es": "flujo-solar-zendure",
      "pl": "zendure-solarflow",
      "uk": "zendure-solarflow",
      "zh-cn": "zendure-solarflow"
    },
    "authors": [
      "Peter <peter.frommert@outlook.com>"
    ],
    "keywords": [
      "Zendure",
      "Solarflow"
    ],
    "licenseInformation": {
      "license": "GPL-3.0-only",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "icon": "zendure-solarflow.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/nograx/ioBroker.zendure-solarflow/main/admin/zendure-solarflow.png",
    "readme": "https://github.com/nograx/ioBroker.zendure-solarflow/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "energy",
    "tier": 2,
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "adminUI": {
      "config": "materialize"
    },
    "eraseOnUpload": true,
    "dependencies": [
      {
        "js-controller": ">=5.0.19"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.4.10"
      }
    ]
  },
  "native": {
    "userName": "",
    "password": "",
    "server": "global",
    "useCalculation": false,
    "useLowVoltageBlock": false,
    "dischargeLimit": 10,
    "useRestart": true
  },
  "encryptedNative": [
    "password"
  ],
  "protectedNative": [
    "password"
  ],
  "objects": [],
  "instanceObjects": []
}
