{
  "common": {
    "name": "zendure-solarflow",
    "version": "3.0.0-alpha.3",
    "news": {
      "3.0.0-alpha.3": {
        "en": "Breaking Change: Change authentication to \"authentication cloud key\". You can generate a key in the official zendure app\nRemoved fallback server\nAdd deviceKey 'a4ss5P' for Solarflow 800\nRefactor a lot of code",
        "de": "Veränderung: Ändern Sie die Authentifizierung auf \"Authentifizierungs-Cloud-Taste\". Sie können einen Schlüssel in der offiziellen Zendure-App generieren\nEntfernen von Fallback-Server\nGerät hinzufügenKey 'a4ss5P' für Solarflow 800\nRefactor eine Menge Code",
        "ru": "Переломные изменения: Измените аутентификацию на «облачный ключ аутентификации». Вы можете создать ключ в официальном приложении zendure\nУдаленный сервер Fallback\nДобавить устройствоKey ‘a4ss5P для Solarflow 800\nРефактор много кода",
        "pt": "Quebrar a Mudança: Alterar autenticação para \"chave de nuvem de autenticação\". Você pode gerar uma chave no aplicativo oficial zendure\nServidor de reserva removido\nAdicionar dispositivoKey 'a4ss5P' para Solarflow 800\nRefactorar um monte de código",
        "nl": "Verandering doorbreken: Authenticatie wijzigen naar \"authentication cloud key.\" U kunt een sleutel genereren in de officiële zindure app\nTerugvalserver verwijderd\nApparaat toevoegenKey 'a4ss5P' voor Solarflow 800\nRefactor veel code",
        "fr": "Briser le changement : Changez l'authentification en \"clé de nuage d'authentification\". Vous pouvez générer une clé dans l'application officielle zendure\nServeur de repli supprimé\nAjouter la clé 'a4ss5P' pour Solarflow 800\nRefactor beaucoup de code",
        "it": "Cambiamento di rottura: Modificare l'autenticazione a \"chiave cloud di autenticazione\". È possibile generare una chiave nell'app ufficiale zendure\nServer di failback rimosso\nAggiungi dispositivoKey 'a4ss5P' per Solarflow 800\nRefactor un sacco di codice",
        "es": "Cambio de ruptura: Cambiar la autenticación a \"la clave de nube de autenticación\". Usted puede generar una clave en la aplicación oficial de zendure\nServidor de retroceso eliminado\nAñadir dispositivoKey 'a4s5P' para el flujo solar 800\nRefactor mucho código",
        "pl": "Łamanie zmian: Zmień uwierzytelnianie na \"klucz do uwierzytelniania w chmurze\". Możesz wygenerować klucz w oficjalnej aplikacji Zabb\nUsunięto serwer awaryjny\nDodaj deviceKey 'a4ss5P' dla Solarflow 800\nZmień dużo kodu",
        "uk": "Зміна несправностей: Зміна автентифікації на \"автентифікаційний ключ хмари\". Ви можете генерувати ключ в офіційному додатку zendure\nВидалити резервний сервер\nДодати пристрійKey 'a4ss5P' для Solarflow 800\nРефактор багато коду",
        "zh-cn": "中断更改 : 认证改为\"认证云密钥\". 您可以在正式 Zendure app 中生成密钥\n删除后退服务器\n为 Solarflow 800 添加设备Key 'a4ss5P'\n重构很多代码"
      },
      "2.0.4": {
        "en": "Fix creation of control states on new Hyper 2000 v3\nUpdates dependencies",
        "de": "Behebung der Erstellung von Steuerungszuständen auf dem neuen Hyper 2000 v3\nAktualisiert Abhängigkeiten",
        "ru": "Исправлена создания состояний управления на новом Hyper 2000 v3\nОбновлены зависимости",
        "pt": "Correção da criação de estados de controle no novo Hyper 2000 v3\nAtualiza dependências",
        "nl": "Oplossing voor het aanmaken van bedieningstoestanden op nieuwe Hyper 2000 v3\nWerk dependencies bij",
        "fr": "Corriger la création des états de contrôle sur le nouveau Hyper 2000 v3\nMise à jour des dépendances",
        "it": "Correzione della creazione degli stati di controllo su Hyper 2000 v3\nAggiornamento delle dipendenze",
        "es": "Corregir la creación de estados de control en el nuevo Hyper 2000 v3.\nActualización de dependencias",
        "pl": "Napraw utworzenie stanów kontrolnych w nowym Hyper 2000 v3\nAktualizacja zależności",
        "uk": "Виправлення створення станів управління на новому Hyper 2000 v3.\nОновлення залежностей",
        "zh-cn": "修复在新的Hyper 2000 v3上创建控制状态\n更新依赖项"
      },
      "2.0.3": {
        "en": "Added 'B3Dxda' as new Hyper 2000 productKey. Removed parameter 'upTime' and 'pullTime' from 'setDeviceAutomationInOutLimit'. TEST: Use 'setDeviceAutomationInOutLimit' to let HUB1200/HUB2000 charge with connected ACE 1500",
        "de": "B3Dxda' als neuer Hyper 2000 productKey hinzugefügt. Parameter 'upTime' und 'pullTime' aus 'setDeviceAutomationInOutLimit' entfernt. TEST: Verwenden Sie 'setDeviceAutomationInOutLimit', um HUB1200/HUB2000 mit angeschlossenem ACE 1500 laden zu lassen.",
        "ru": "Добавлен 'B3Dxda' в качестве нового ключа устройства Hyper 2000. Удалены параметры 'upTime' и 'pullTime' из 'setDeviceAutomationInOutLimit'. ТЕСТ: Используйте 'setDeviceAutomationInOutLimit', чтобы позволить HUB1200/HUB2000 заряжаться с подключенным ACE 1500.",
        "pt": "Adicionado 'B3Dxda' como nova productKey Hyper 2000. Removido o parâmetro 'upTime' e 'pullTime' de 'setDeviceAutomationInOutLimit'. TESTE: Utilizar 'setDeviceAutomationInOutLimit' para permitir que o HUB1200/HUB2000 carregue com o ACE 1500 ligado",
        "nl": "B3Dxda' toegevoegd als nieuwe Hyper 2000 productKey. Parameter 'upTime' en 'pullTime' verwijderd uit 'setDeviceAutomationInOutLimit'. TEST: Gebruik 'setDeviceAutomationInOutLimit' om HUB1200/HUB2000 te laten laden met aangesloten ACE 1500.",
        "fr": "Ajout de 'B3Dxda' comme nouvelle clé de périphérique Hyper 2000. Suppression des paramètres 'upTime' et 'pullTime' de 'setDeviceAutomationInOutLimit'. TEST : Utilisez 'setDeviceAutomationInOutLimit' pour permettre au HUB1200/HUB2000 de se recharger avec un ACE 1500 connecté.",
        "it": "Aggiunto 'B3Dxda' come nuovo productKey Hyper 2000. Rimosso il parametro 'upTime' e 'pullTime' da 'setDeviceAutomationInOutLimit'. TEST: utilizzare 'setDeviceAutomationInOutLimit' per consentire a HUB1200/HUB2000 di caricarsi con l'ACE 1500 collegato.",
        "es": "Añadido 'B3Dxda' como nuevo productKey de Hyper 2000. Eliminados los parámetros 'upTime' y 'pullTime' de 'setDeviceAutomationInOutLimit'. PRUEBA: Utiliza 'setDeviceAutomationInOutLimit' para que HUB1200/HUB2000 se cargue con ACE 1500 conectado.",
        "pl": "Dodano \"B3Dxda\" jako nowy klucz urządzenia Hyper 2000. Usunięto parametr 'upTime' i 'pullTime' z 'setDeviceAutomationInOutLimit'. TEST: Użyj 'setDeviceAutomationInOutLimit', aby umożliwić ładowanie HUB1200/HUB2000 z podłączonym ACE 1500.",
        "uk": "Додано 'B3Dxda' як новий Hyper 2000 productKey. Видалено параметри 'upTime' та 'pullTime' з 'setDeviceAutomationInOutLimit'. ТЕСТ: Використовуйте 'setDeviceAutomationInOutLimit', щоб дозволити HUB1200/HUB2000 заряджатися з підключеним ACE 1500",
        "zh-cn": "Added 'B3Dxda' as new Hyper 2000 productKey. Removed parameter 'upTime' and 'pullTime' from 'setDeviceAutomationInOutLimit'. TEST: Use 'setDeviceAutomationInOutLimit' to let HUB1200/HUB2000 charge with connected ACE 1500"
      },
      "2.0.1": {
        "en": "Small fix MQTT service",
        "de": "Kleiner MQTT-Service",
        "ru": "Небольшой ремонт MQTT",
        "pt": "Pequeno serviço de correção MQTT",
        "nl": "Kleine reparatie MQTT service",
        "fr": "Petit service MQTT fixe",
        "it": "Servizio MQTT piccolo fix",
        "es": "Servicio de fijación pequeña MQTT",
        "pl": "Usługa małej naprawy MQTT",
        "uk": "Невелика фіксація MQTT сервіс",
        "zh-cn": "小修补 MQTT 服务"
      },
      "2.0.0": {
        "en": "Breaking Change: Add control parameter 'setDeviceAutomationInOutLimit' which emulates Zendure's Smart Matching mode. I recommend using this device automation instead of 'setInputLimit'/'setOutputLimit' from now on, as there were concerns that setting limits/modes would be stored in the flash memory. You can use negative values for charging and positive for feed in. On HUB 1200/2000 with ACE 1500 you can use \"smartMode\" to prevent switching AC mode trigger writing to the flash memory. Check you the readme for more details or participate in the ioBroker forum.",
        "de": "Veränderung: Fügen Sie den Steuerparameter 'setDeviceAutomationInOutLimit' hinzu, der den Smart Matching-Modus von Zendure emuliert. Ich empfehle, diese Geräteautomatisierung anstelle von 'setInputLimit'/'setOutputLimit' von jetzt an zu verwenden, da es Bedenken gab, dass Einstelllimits/Mode im Flash-Speicher gespeichert würden. Sie können negative Werte für das Laden und positiv für das Einspeisen verwenden. Auf HUB 1200/2000 mit ACE 1500 können Sie \"smartMode\" verwenden, um zu verhindern, dass Wechselstrommodus das Schreiben an den Flash-Speicher auslöst. Überprüfen Sie das Readme für weitere Details oder nehmen Sie am ioBroker Forum teil.",
        "ru": "Переломные изменения: Добавьте параметр управления «setDeviceAutomationInOutLimit», который эмулирует режим Smart Matching от Zendure. Отныне я рекомендую использовать автоматизацию этого устройства вместо «setInputLimit» / «setOutputLimit», поскольку были опасения, что установка ограничений / режимов будет храниться во флэш-памяти. Вы можете использовать отрицательные значения для зарядки и положительные для подачи. На HUB 1200/2000 с ACE 1500 можно использовать «smartMode», чтобы предотвратить переключение записи в режиме переменного тока на флэш-память. Проверьте Readme для получения более подробной информации или участвуйте в форуме ioBroker.",
        "pt": "Quebrar a Mudança: Adicionar parâmetro de controle 'setDeviceAutomationInOutLimit' que emula o modo Smart Matching da Zendure. Eu recomendo usar esta automação de dispositivo em vez de 'setInputLimit'/'setOutputLimit' a partir de agora, como havia preocupações de que definir limites/modos seria armazenado na memória flash. Você pode usar valores negativos para carregar e positivos para alimentação. Em HUB 1200/2000 com ACE 1500 você pode usar \"smartMode\" para evitar a ativação do modo AC de comutação de gravação para a memória flash. Confira o readme para mais detalhes ou participe no fórum ioBroker.",
        "nl": "Verandering doorbreken: Voeg controleparameter 'setDeviceAutomationInOutLimit' toe die Zendure's Smart Matching-modus emuleert. Ik adviseer deze apparaatautomatisering vanaf nu te gebruiken in plaats van 'setInputLimit'/'setOutputLimit', omdat er bezorgdheid bestond dat het instellen van limieten/modi in het flitsgeheugen zou worden opgeslagen. U kunt negatieve waarden gebruiken voor het opladen en positief voor voer in. Op HUB 1200/2000 met ACE 1500 kunt u \"smartMode\" gebruiken om te voorkomen dat het schakelen van de AC-modus trigger schrijven naar het flitsgeheugen. Bekijk de readme voor meer details of neem deel aan het ioBroker forum.",
        "fr": "Briser le changement : Ajouter le paramètre de contrôle 'setDeviceAutomationInOutLimit' qui émule le mode Smart Matching de Zendure. Je recommande d'utiliser cette automatisation de périphérique au lieu de 'setInputLimit'/'setOutputLimit' à partir de maintenant, car il y avait des préoccupations que le réglage des limites/modes serait stocké dans la mémoire flash. Vous pouvez utiliser des valeurs négatives pour la charge et positives pour l'alimentation. Sur HUB 1200/2000 avec ACE 1500, vous pouvez utiliser \"smartMode\" pour empêcher le passage de l'écriture du déclencheur en mode AC à la mémoire flash. Vérifiez la lecture pour plus de détails ou participez au forum ioBroker.",
        "it": "Cambiamento di rottura: Aggiungi il parametro di controllo 'setDeviceAutomationInOutLimit' che emula la modalità Smart Matching di Zendure. Raccomando di utilizzare questo dispositivo di automazione invece di 'setInputLimit'/'setOutputLimit' da ora in poi, in quanto vi erano preoccupazioni che la regolazione dei limiti/modi sarebbe memorizzata nella memoria flash. È possibile utilizzare valori negativi per la ricarica e positivo per il feed in. Su HUB 1200/2000 con ACE 1500 è possibile utilizzare \"smartMode\" per evitare di commutare la modalità AC di attivare la scrittura alla memoria flash. Controlla il readme per maggiori dettagli o partecipa al forum ioBroker.",
        "es": "Cambio de ruptura: Añadir parámetro de control 'setDeviceAutomationInOutLimit' que emula el modo Smart Matching de Zendure. Recomiendo usar esta automatización de dispositivos en lugar de 'setInputLimit'/'setOutputLimit' a partir de ahora, ya que había preocupaciones de que fijar límites/modes se almacenarían en la memoria flash. Puede utilizar valores negativos para cargar y positivos para alimentarse. En HUB 1200/2000 con ACE 1500 se puede utilizar \"smartMode\" para evitar cambiar el modo AC activando la escritura a la memoria flash. Comprueba la lectura para más detalles o participa en el foro ioBroker.",
        "pl": "Łamanie zmian: Dodaj parametr sterowania 'setDeviceAutomationInOutLimit', który emuluje tryb inteligentnego dopasowywania Zhamb. Zalecam stosowanie automatyzacji tego urządzenia zamiast 'setInputLimit' / 'setOutputLimit' od teraz, ponieważ istniały obawy, że ustawianie limitów / trybów będzie przechowywane w pamięci flash. Możesz użyć wartości ujemnych do ładowania i dodatnich do podawania. W HUB 1200 / 2000 z ACE 1500 można użyć \"smartMode\", aby zapobiec przełączaniu zapisu trybu AC do pamięci flash. Sprawdź czytaj więcej szczegółów lub uczestnicz w forum jOBroker.",
        "uk": "Зміна несправностей: Додавання параметра керування «setDeviceAutomationInOutLimit», який визначає режим Smart Matching Zendure. Я рекомендую використовувати цей пристрій автоматизації замість 'setInputLimit'/'setOutputLimit' відтепер, оскільки є побоювання, що налаштування лімітів/модів буде зберігатися в флеш-пам'яті. Ви можете використовувати негативні значення для зарядки та позитиву для живлення. На HUB 1200/2000 з ACE 1500 ви можете використовувати \"smartMode\" для запобігання перемикання режиму змінного струму, що тривають на флеш-пам'ять. Перевірити читання для отримання більш детальної інформації або участі в форумі ioBroker.",
        "zh-cn": "中断更改 : 添加模拟 Zendure 智能匹配模式的控制参数“ set DeviceAutomation InOutLimit ” 。 我建议从现在开始使用这个设备自动化, 而不是“ setInputLimit ” /“ setOutputLimit ” , 因为有人担心设定限制/ modes会存储在闪存中 。 可以使用负值充电,正值用于饲料输入. 在 HUB 1200/2000 与 ACE 1500 可以使用\"smartMode\"来防止将 AC 模式触发写入到闪存中. 请检查access-date=中的日期值 (帮助) 更多细节或参加ioBroker论坛."
      },
      "2.0.0-alpha.1": {
        "en": "Breaking Change: Add control parameter 'setDeviceAutomationInOutLimit' which emulates Zendure's Smart Matching mode. Since there were concerns that setting limits would be stored in the flash memory, I recommend using this device automation instead of 'setInputLimit'/'setOutputLimit' from now on. You can use negative values for charging and positive for feed in.",
        "de": "Veränderung: Fügen Sie den Steuerparameter 'setDeviceAutomationInOutLimit' hinzu, der den Smart Matching-Modus von Zendure emuliert. Da Bedenken bestehen, dass Einstellgrenzen im Flash-Speicher gespeichert werden würden, empfehle ich die Verwendung dieser Geräteautomatisierung anstelle von 'setInputLimit'/'setOutputLimit' von jetzt an. Sie können negative Werte für das Laden und positiv für das Einspeisen verwenden.",
        "ru": "Переломные изменения: Добавьте параметр управления «setDeviceAutomationInOutLimit», который эмулирует режим Smart Matching от Zendure. Поскольку были опасения, что установление ограничений будет храниться во флэш-памяти, я рекомендую использовать эту автоматизацию устройства вместо «setInputLimit» / «setOutputLimit». Вы можете использовать отрицательные значения для зарядки и положительные для подачи.",
        "pt": "Quebrar a Mudança: Adicionar parâmetro de controle 'setDeviceAutomationInOutLimit' que emula o modo Smart Matching da Zendure. Como havia preocupações de que a definição de limites seria armazenada na memória flash, eu recomendo usar esta automação do dispositivo em vez de 'setInputLimit'/'setOutputLimit' a partir de agora. Você pode usar valores negativos para carregar e positivos para alimentação.",
        "nl": "Verandering doorbreken: Voeg controleparameter 'setDeviceAutomationInOutLimit' toe die Zendure's Smart Matching-modus emuleert. Aangezien er bezorgdheid was dat het instellen van limieten in het flashgeheugen zou worden opgeslagen, raad ik aan om deze apparaatautomatisering te gebruiken in plaats van 'setInputLimit'/'setOutputLimit' vanaf nu. U kunt negatieve waarden gebruiken voor het opladen en positief voor voer in.",
        "fr": "Briser le changement : Ajouter le paramètre de contrôle 'setDeviceAutomationInOutLimit' qui émule le mode Smart Matching de Zendure. Étant donné qu'il y avait des inquiétudes quant au stockage des limites de réglage dans la mémoire flash, je recommande d'utiliser cette automatisation au lieu de 'setInputLimit'/'setOutputLimit' à partir de maintenant. Vous pouvez utiliser des valeurs négatives pour la charge et positives pour l'alimentation.",
        "it": "Cambiamento di rottura: Aggiungi il parametro di controllo 'setDeviceAutomationInOutLimit' che emula la modalità Smart Matching di Zendure. Poiché ci sono state preoccupazioni che i limiti di impostazione sarebbero stati memorizzati nella memoria flash, consiglio di utilizzare questo dispositivo di automazione invece di 'setInputLimit'/'setOutputLimit' da ora in poi. È possibile utilizzare valori negativi per la ricarica e positivo per il feed in.",
        "es": "Cambio de ruptura: Añadir parámetro de control 'setDeviceAutomationInOutLimit' que emula el modo Smart Matching de Zendure. Dado que había preocupaciones de que los límites de configuración se almacenarían en la memoria flash, recomiendo usar esta automatización de dispositivos en lugar de 'setInputLimit'/'setOutputLimit' de ahora en adelante. Puede utilizar valores negativos para cargar y positivos para alimentarse.",
        "pl": "Łamanie zmian: Dodaj parametr sterowania 'setDeviceAutomationInOutLimit', który emuluje tryb inteligentnego dopasowywania Zhamb. Ponieważ pojawiły się obawy, że w pamięci flash zostaną zapisane granice ustawień, zalecam stosowanie automatyzacji tego urządzenia zamiast 'setInputLimit' / 'setOutputLimit'. Możesz użyć wartości ujemnych do ładowania i dodatnich do podawania.",
        "uk": "Зміна несправностей: Додавання параметра керування «setDeviceAutomationInOutLimit», який визначає режим Smart Matching Zendure. З тих пір, як було занепокоєння, що обмеження налаштування будуть зберігатися в флеш-пам'яті, я рекомендую використовувати цей пристрій автоматизації замість 'setInputLimit'/'setOutputLimit' відтепер. Ви можете використовувати негативні значення для зарядки та позитиву для живлення.",
        "zh-cn": "中断更改 : 添加模拟 Zendure 智能匹配模式的控制参数“ set DeviceAutomation InOutLimit ” 。 由于有人担心设定限制会存储在闪存中,我建议从现在开始使用这个设备自动化,而不是“setInputLimit”/“setOutputLimit”. 可以使用负值充电,正值用于饲料输入."
      }
    },
    "titleLang": {
      "en": "Zendure Solarflow",
      "de": "Zendure Solarflow",
      "ru": "Зендуре Соларфлоу",
      "pt": "Zendure Solarflow",
      "nl": "Zendure Solarflow",
      "fr": "Flux solaire Zendure",
      "it": "Zendur Solarflow",
      "es": "Zendure Solarflow",
      "pl": "Zendure Solarflow",
      "uk": "Zendure Solarflow",
      "zh-cn": "Zendure Solarflow"
    },
    "desc": {
      "en": "zendure-solarflow",
      "de": "Zendure-Solarflow",
      "ru": "Zendure-Solarflow",
      "pt": "zendure-solarflow",
      "nl": "zendure-solarflow",
      "fr": "zendure-solarflow",
      "it": "zendure-solarflow",
      "es": "flujo-solar-zendure",
      "pl": "zendure-solarflow",
      "uk": "zendure-solarflow",
      "zh-cn": "zendure-solarflow"
    },
    "authors": [
      "Peter <peter.frommert@outlook.com>"
    ],
    "keywords": [
      "Zendure",
      "Solarflow"
    ],
    "licenseInformation": {
      "license": "GPL-3.0-only",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "icon": "zendure-solarflow.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/nograx/ioBroker.zendure-solarflow/main/admin/zendure-solarflow.png",
    "readme": "https://github.com/nograx/ioBroker.zendure-solarflow/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "energy",
    "tier": 2,
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "adminUI": {
      "config": "materialize"
    },
    "eraseOnUpload": true,
    "dependencies": [
      {
        "js-controller": ">=5.0.19"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.4.10"
      }
    ],
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.0.0",
            "newVersion>=3.0.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!"
        },
        "text": {
          "en": "BREAKING CHANGE. <br> Changed authentication with username/password to 'cloud authentication key'. You have to generate a key in the official zendure app!<br>'Fallback server' is no longer supported and removed in this version!",
          "de": "ÄNDERUNG. <br> Die Authentifizierung mit Benutzername/Passwort wurde auf 'Cloud-Authentifizierungsschlüssel' geändert. Sie müssen einen Schlüssel in der offiziellen Zendure-App generieren!<br>'Fallback Server' wird nicht mehr unterstützt und in dieser Version entfernt!",
          "ru": "ИЗМЕНЕНИЕ. <br> Заменена аутентификация с помощью имени пользователя/пароля на \"ключ облачной аутентификации\". Вы должны сгенерировать ключ в официальном приложении zendure!<br> \"Fallback server\" больше не поддерживается и удален в этой версии!",
          "pt": "MUDANÇA DE RUPTURA. <br> Alterada a autenticação com nome de usuário/senha para 'chave de autenticação na nuvem'. Você precisa gerar uma chave no aplicativo oficial do zendure!<br>'Servidor de fallback' não é mais suportado e foi removido nesta versão!",
          "nl": "BREAKING WIJZIGING. <br> Verandering van authenticatie met gebruikersnaam/wachtwoord naar 'cloud authenticatie sleutel'. Je moet een sleutel genereren in de officiële zendure app!<br>'Fallback server' wordt niet langer ondersteund en verwijderd in deze versie!",
          "fr": "BREAKING CHANGE. <br>Changement de l'authentification par nom d'utilisateur/mot de passe en 'clé d'authentification cloud'. Vous devez générer une clé dans l'application officielle de zendure!<br>Le 'Fallback server' n'est plus supporté et supprimé dans cette version !",
          "it": "MODIFICA DI ROTTURA. <br> Cambiata l'autenticazione con nome utente/password in 'chiave di autenticazione cloud'. È necessario generare una chiave nell'app ufficiale di zendure!<br> Il 'Fallback server' non è più supportato e viene rimosso in questa versione!",
          "es": "CAMBIO DE ÚLTIMA HORA. <br> Cambiada la autenticación con nombre de usuario/contraseña a 'clave de autenticación en la nube'. Usted tiene que generar una clave en la aplicación oficial zendure!<br>'Fallback server' ya no es compatible y eliminado en esta versión!",
          "pl": "PRZEŁOMOWA ZMIANA. <br> Zmieniono uwierzytelnianie za pomocą nazwy użytkownika/hasła na \"klucz uwierzytelniania w chmurze\". Musisz wygenerować klucz w oficjalnej aplikacji zendure!<br>\"Serwer awaryjny\" nie jest już obsługiwany i został usunięty w tej wersji!",
          "uk": "ЗМІНА, ЩО РУЙНУЄ. <br> Змінено автентифікацію за допомогою імені користувача/пароля на \"хмарний ключ автентифікації\". Ви повинні згенерувати ключ в офіційному додатку zendure! <br>\"Резервний сервер\" більше не підтримується і вилучений у цій версії!",
          "zh-cn": "BREAKING CHANGE. <br> Changed authentication with username/password to 'cloud authentication key'. You have to generate a key in the official zendure app!<br>'Fallback server' is no longer supported and removed in this version!"
        },
        "link": "https://github.com/nograx/ioBroker.zendure-solarflow/blob/main/README.md",
        "level": "warn",
        "linkText": {
          "en": "Readme",
          "de": "Liesmich",
          "ru": "Прочти меня",
          "pt": "Leia-me",
          "nl": "Leesmij",
          "fr": "Lisez-moi",
          "it": "Leggimi",
          "es": "Léame",
          "pl": "Readme",
          "zh-cn": "自述文件"
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {
    "userName": "",
    "password": "",
    "connectionMode": "authKey",
    "authorizationCloudKey": "",
    "server": "global",
    "useCalculation": false,
    "useLowVoltageBlock": false,
    "dischargeLimit": 10,
    "useRestart": true
  },
  "encryptedNative": [
    "password"
  ],
  "protectedNative": [
    "password"
  ],
  "objects": [],
  "instanceObjects": []
}
