{
  "common": {
    "name": "zendure-solarflow",
    "version": "1.10.2",
    "news": {
      "1.10.2": {
        "en": "Fix calculation of grid input power on ace\nCorrect standby usage of battery if conncted with ace (add additional 10W)",
        "de": "Fixe Berechnung der Netzeingangsleistung auf Ace\nRichtige Standby-Nutzung der Batterie, wenn mit ace konncted (add zusätzliche 10W)",
        "ru": "Исчисление сетки входной мощности на туз\nПравильное резервное использование аккумулятора, если он сложен с тузом (добавьте дополнительно 10W)",
        "pt": "Corrigir o cálculo do poder de entrada da grade em ás\nUso correto de espera da bateria se conncted com ace (add adicional 10W)",
        "nl": "Fix berekening van het ingangsvermogen van het net op aas\nCorrect stand-by-gebruik van de batterij indien verbonden met een aas (voeg nog 10W toe)",
        "fr": "Calcul de la puissance d'entrée du réseau sur as\nUtilisation correcte en veille de la batterie si elle est connectée à un as (ajouter 10W supplémentaires)",
        "it": "Fissare il calcolo della potenza di ingresso della griglia su ace\nCorretto uso standby della batteria se connessa con asso (add aggiuntivo 10W)",
        "es": "Fijar el cálculo de la energía de entrada de la red en el as\nUso correcto de la reserva de la batería si se conncted con as (add adicional 10W)",
        "pl": "Napraw obliczanie mocy wejściowej sieci na asie\nPrawidłowe korzystanie z akumulatora w trybie czuwania po połączeniu z asem (dodać dodatkowe 10W)",
        "uk": "Фіксований розрахунок потужності вводу сітки на аце\nПравильне використання акумулятора в режимі очікування (додатково 10 Вт)",
        "zh-cn": "固定 A 上的网格输入功率计算\n正确的备用电池使用,如果与 A 相连接(增加 10 W)"
      },
      "1.10.1": {
        "en": "Fix input limit when hub is bundled with ace\nFix calculation when low voltage block is activated",
        "de": "Fix Eingabegrenze, wenn Nabe mit Spitze gebündelt wird\nFixberechnung bei aktiviertem Niederspannungsblock",
        "ru": "Исправление лимита ввода, когда хаб соединен с тузом\nИсчисление ix при активации блока низкого напряжения",
        "pt": "Corrigir limite de entrada quando o hub é empacotado com ace\nCorrigir cálculo quando o bloco de baixa tensão é ativado",
        "nl": "Fix ingang limiet wanneer hub is gebundeld met aas\nFix berekening wanneer laagspanningsblok wordt geactiveerd",
        "fr": "Fixer la limite d'entrée lorsque le hub est livré avec as\nCorrection du calcul lorsque le bloc basse tension est activé",
        "it": "Fissare il limite di ingresso quando il mozzo è in bundle con ace\nFissare il calcolo quando si attiva il blocco a bassa tensione",
        "es": "Fijar el límite de entrada cuando el hub está empaquetado con as\nCálculo de fijación cuando se activa el bloque de baja tensión",
        "pl": "Popraw limit wejścia, gdy piasta jest połączona z asem\nObliczenie fix po uruchomieniu bloku niskiego napięcia",
        "uk": "Фіксований ліміт вводу при введенні хаба\nФіксований розрахунок при активації блоку низької напруги",
        "zh-cn": "与 A 捆绑时固定输入限制\n启动低压块时固定计算"
      },
      "1.10.0": {
        "en": "Add setting to perform a full charge if SOC from Zendure is greater than 50% when on low voltage\nBugfixes",
        "de": "Hinzufügen der Einstellung, um eine volle Ladung, wenn SOC aus Zendure ist größer als 50% bei niedriger Spannung\nBugfixes",
        "ru": "Добавление настройки для выполнения полного заряда, если SOC от Zendure больше 50% при низком напряжении\nBugfixs",
        "pt": "Adicionar configuração para executar uma carga completa se SOC de Zendure é maior que 50% quando em baixa tensão\nBugfixs",
        "nl": "Voeg instellingen toe om een volledige lading uit te voeren als SOC van Zendure groter is dan 50% bij lage spanning\nBugfixes",
        "fr": "Ajouter le réglage pour effectuer une charge complète si le SOC de Zendure est supérieur à 50 %s ur basse tension\nFixes de bogue",
        "it": "Aggiungere l'impostazione per eseguire una carica completa se SOC da Zendure è maggiore del 50% quando su bassa tensione\nBugfix",
        "es": "Agregar ajuste para realizar una carga completa si SOC de Zendure es mayor que 50% cuando en baja tensión\nBugfixes",
        "pl": "Dodaj ustawienie do wykonania pełnego ładowania, jeśli SOC z Zharb jest większa niż 50% przy niskim napięciu\nKorekty błędów",
        "uk": "Додати налаштування для виконання повного заряду, якщо SOC від Zendure перевищує 50% при низькій напрузі\nПомилки",
        "zh-cn": "如果来自Zendure的SOC在低电压时大于50%,则添加设置以完成全电荷\n错误修正"
      },
      "1.9.3": {
        "en": "Fix for Low Voltage Block not deactivated.",
        "de": "Fix für Niederspannung Block nicht deaktiviert.",
        "ru": "Fix для низкого напряжения Блок не отключен.",
        "pt": "Fix para baixa tensão Bloquear não desativado.",
        "nl": "Fix voor lage spanning Blok niet gedeactiveerd.",
        "fr": "Correction pour basse tension Bloc non désactivé.",
        "it": "Fissaggio per bassa tensione Blocco non disattivato.",
        "es": "Fijación para baja tensión Bloque no desactivado.",
        "pl": "Napraw dla niskiego napięcia Blok nie wyłączony.",
        "uk": "Фіксація для низького напруги Блок не деактивований.",
        "zh-cn": "低电压修复 屏蔽未关闭 ."
      },
      "1.9.2": {
        "en": "Fix state some definitions",
        "de": "Einige Definitionen festlegen",
        "ru": "Установить некоторые определения",
        "pt": "Corrigir estado algumas definições",
        "nl": "Fix geeft enkele definities",
        "fr": "Fixer les définitions",
        "it": "Fissare lo stato alcune definizioni",
        "es": "Determinar el estado algunas definiciones",
        "pl": "Popraw niektóre definicje",
        "uk": "Виправлення стану деяких визначення",
        "zh-cn": "修正一些定义"
      },
      "1.9.1": {
        "en": "Improvement for 'Low Voltage Block'.\nChanged the state \"hubState\" a an option value.",
        "de": "Verbesserung für 'Low Voltage Block'.\nÄnderte den Zustand \"hubState\" einen Optionswert.",
        "ru": "Улучшение «Low Voltage Block».\nИзменил государственную «hubState» как альтернативную стоимость.",
        "pt": "Melhoria para \"Low Voltage Block\".\nAlterou o estado \"hubState\" um valor de opção.",
        "nl": "Verbetering voor 'Low Voltage Block'.\nVeranderde de status \"hubState\" een optiewaarde.",
        "fr": "Amélioration pour 'Block basse tension'.\nChangement de l'état \"hubState\" une valeur d'option.",
        "it": "Miglioramento per 'Low Tension Block'.\nCambiato lo stato \"hubState\" un valore di opzione.",
        "es": "Mejora para 'Low Voltage Block'.\nCambió el estado \"hubState\" un valor de opción.",
        "pl": "Poprawa dla \"bloku niskiego napięcia\".\nZmieniła wartość opcji państwa \"hubState\".",
        "uk": "Удосконалення для блоку напруги \"Low\".\nЗмінено стан \"hubState\" варіант значення.",
        "zh-cn": "改进\"低伏特格\".\n更改州\"hubstate\"为选项值."
      },
      "1.9.0": {
        "en": "New option to force Solarflow device to go offline when \"Low Voltage Block\"-option is used.",
        "de": "Neue Option, Solarflow-Gerät zu zwingen, offline zu gehen, wenn \"Low Voltage Block\"-Option verwendet wird.",
        "ru": "Новая опция заставить устройство Solarflow выйти в автономном режиме, когда используется опция «Low Voltage Block».",
        "pt": "Nova opção para forçar o dispositivo Solarflow a ficar offline quando a opção \"Low Voltage Block\" é usada.",
        "nl": "Nieuwe optie om Solarflow apparaat te dwingen offline te gaan wanneer \"Low Voltage Blok\"-optie wordt gebruikt.",
        "fr": "Nouvelle option pour forcer le périphérique Solarflow à déconnecter lorsque l'option \"Block basse tension\" est utilisée.",
        "it": "Nuova opzione per forza dispositivo Solarflow per andare offline quando \"Low Tensione Block\"-opzione è utilizzato.",
        "es": "Nueva opción para forzar el dispositivo Solarflow a salir fuera de línea cuando se utiliza la opción \"Low Voltage Block\".",
        "pl": "Nowa opcja zmuszenia urządzenia Solarflow do offline przy użyciu opcji \"Block niskiego napięcia\".",
        "uk": "Використовується новий варіант для відключення пристроїв Solarflow при \"Low Блок напруги\"-опція.",
        "zh-cn": "使用“ Low Voltage Block”- 选项时, 强制 Solarflow 设备下线的新选项 ."
      }
    },
    "titleLang": {
      "en": "Zendure Solarflow",
      "de": "Zendure Solarflow",
      "ru": "Зендуре Соларфлоу",
      "pt": "Zendure Solarflow",
      "nl": "Zendure Solarflow",
      "fr": "Flux solaire Zendure",
      "it": "Zendur Solarflow",
      "es": "Zendure Solarflow",
      "pl": "Zendure Solarflow",
      "uk": "Zendure Solarflow",
      "zh-cn": "Zendure Solarflow"
    },
    "desc": {
      "en": "zendure-solarflow",
      "de": "Zendure-Solarflow",
      "ru": "Zendure-Solarflow",
      "pt": "zendure-solarflow",
      "nl": "zendure-solarflow",
      "fr": "zendure-solarflow",
      "it": "zendure-solarflow",
      "es": "flujo-solar-zendure",
      "pl": "zendure-solarflow",
      "uk": "zendure-solarflow",
      "zh-cn": "zendure-solarflow"
    },
    "authors": [
      "Peter <peter.frommert@outlook.com>"
    ],
    "keywords": [
      "Zendure",
      "Solarflow"
    ],
    "licenseInformation": {
      "license": "GPL-3.0-only",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "icon": "zendure-solarflow.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/nograx/ioBroker.zendure-solarflow/main/admin/zendure-solarflow.png",
    "readme": "https://github.com/nograx/ioBroker.zendure-solarflow/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "energy",
    "tier": 2,
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "adminUI": {
      "config": "materialize"
    },
    "eraseOnUpload": true,
    "dependencies": [
      {
        "js-controller": ">=5.0.19"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.0.0"
      }
    ]
  },
  "native": {
    "userName": "",
    "server": "global",
    "useCalculation": false,
    "useLowVoltageBlock": false,
    "dischargeLimit": 10
  },
  "encryptedNative": [
    "password"
  ],
  "protectedNative": [
    "password"
  ],
  "objects": [],
  "instanceObjects": []
}
