{
  "common": {
    "name": "zendure-solarflow",
    "version": "2.0.0-alpha.0",
    "news": {
      "2.0.0-alpha.0": {
        "en": "Breaking Change: Add control parameter 'setDeviceAutomation' which emulates Zendure's Smart Matching mode. Since there were concerns that setting limits would be stored in the flash memory, I recommend using this device automation instead of 'setInputLimit'/'setOutputLimit' from now on. You can use negative values for charging and positive for feed in.",
        "de": "Veränderung: Fügen Sie den Steuerparameter 'setDeviceAutomation' hinzu, der den Smart Matching-Modus von Zendure emuliert. Da Bedenken bestehen, dass Einstellgrenzen im Flash-Speicher gespeichert werden würden, empfehle ich die Verwendung dieser Geräteautomatisierung anstelle von 'setInputLimit'/'setOutputLimit' von jetzt an. Sie können negative Werte für das Laden und positiv für das Einspeisen verwenden.",
        "ru": "Переломные изменения: Добавьте параметр управления «setDeviceAutomation», который эмулирует режим Smart Matching от Zendure. Поскольку были опасения, что установление ограничений будет храниться во флэш-памяти, я рекомендую использовать эту автоматизацию устройства вместо «setInputLimit» / «setOutputLimit». Вы можете использовать отрицательные значения для зарядки и положительные для подачи.",
        "pt": "Quebrar a Mudança: Adicionar parâmetro de controle 'setDeviceAutomation' que emula o modo Smart Matching da Zendure. Como havia preocupações de que a definição de limites seria armazenada na memória flash, eu recomendo usar esta automação do dispositivo em vez de 'setInputLimit'/'setOutputLimit' a partir de agora. Você pode usar valores negativos para carregar e positivos para alimentação.",
        "nl": "Verandering doorbreken: Voeg controleparameter 'setDeviceAutomation' toe die Zendure's Smart Matching-modus emuleert. Aangezien er bezorgdheid was dat het instellen van limieten in het flashgeheugen zou worden opgeslagen, raad ik aan om deze apparaatautomatisering te gebruiken in plaats van 'setInputLimit'/'setOutputLimit' vanaf nu. U kunt negatieve waarden gebruiken voor het opladen en positief voor voer in.",
        "fr": "Briser le changement : Ajouter le paramètre de contrôle 'setDeviceAutomation' qui émule le mode Smart Matching de Zendure. Étant donné qu'il y avait des inquiétudes quant au stockage des limites de réglage dans la mémoire flash, je recommande d'utiliser cette automatisation au lieu de 'setInputLimit'/'setOutputLimit' à partir de maintenant. Vous pouvez utiliser des valeurs négatives pour la charge et positives pour l'alimentation.",
        "it": "Cambiamento di rottura: Aggiungi il parametro di controllo 'setDeviceAutomation' che emula la modalità Smart Matching di Zendure. Poiché ci sono state preoccupazioni che i limiti di impostazione sarebbero stati memorizzati nella memoria flash, consiglio di utilizzare questo dispositivo di automazione invece di 'setInputLimit'/'setOutputLimit' da ora in poi. È possibile utilizzare valori negativi per la ricarica e positivo per il feed in.",
        "es": "Cambio de ruptura: Añadir parámetro de control 'setDeviceAutomation' que emula el modo Smart Matching de Zendure. Dado que había preocupaciones de que los límites de configuración se almacenarían en la memoria flash, recomiendo usar esta automatización de dispositivos en lugar de 'setInputLimit'/'setOutputLimit' de ahora en adelante. Puede utilizar valores negativos para cargar y positivos para alimentarse.",
        "pl": "Łamanie zmian: Dodaj parametr sterowania 'setDeviceAutomation', który emuluje tryb Smart Matching Zabada. Ponieważ pojawiły się obawy, że w pamięci flash zostaną zapisane granice ustawień, zalecam stosowanie automatyzacji tego urządzenia zamiast 'setInputLimit' / 'setOutputLimit'. Możesz użyć wartości ujemnych do ładowania i dodatnich do podawania.",
        "uk": "Зміна несправностей: Додавання параметра керування «setDeviceAutomation», який визначає режим Smart Matching Zendure. З тих пір, як було занепокоєння, що обмеження налаштування будуть зберігатися в флеш-пам'яті, я рекомендую використовувати цей пристрій автоматизації замість 'setInputLimit'/'setOutputLimit' відтепер. Ви можете використовувати негативні значення для зарядки та позитиву для живлення.",
        "zh-cn": "中断更改 : 添加模拟 Zendure 智能匹配模式的控制参数“ setDeviceAutomation ” 。 由于有人担心设定限制会存储在闪存中,我建议从现在开始使用这个设备自动化,而不是“setInputLimit”/“setOutputLimit”. 可以使用负值充电,正值用于饲料输入."
      },
      "1.15.4": {
        "en": "Add smart mode control parameter for more devices",
        "de": "Smart-Mode-Control-Parameter für mehr Geräte hinzufügen",
        "ru": "Добавьте параметр управления умным режимом для большего количества устройств",
        "pt": "Adicionar parâmetro de controle de modo inteligente para mais dispositivos",
        "nl": "Smart mode control parameter voor meer apparaten toevoegen",
        "fr": "Ajouter le paramètre de contrôle du mode intelligent pour plus de périphériques",
        "it": "Aggiungi il parametro di controllo della modalità intelligente per più dispositivi",
        "es": "Añadir parámetro de control de modo inteligente para más dispositivos",
        "pl": "Dodaj inteligentny parametr sterowania trybem dla większej liczby urządzeń",
        "uk": "Додавання параметра керування смарт-режимом для більших пристроїв",
        "zh-cn": "为更多设备添加智能模式控制参数"
      },
      "1.15.3": {
        "en": "Match case sensitive product key for SF 2400 AC and SF 800 in settings if local mode is used\nAdd sensor and control of \"SmartMode\"",
        "de": "Passender Case sensitiver Produktschlüssel für SF 2400 AC und SF 800 in Einstellungen, wenn der lokale Modus verwendet wird\nSensor und Steuerung von \"SmartMode\" hinzufügen",
        "ru": "Ключ для SF 2400 AC и SF 800 в настройках, если используется локальный режим\nДобавить сенсор и управление «SmartMode»",
        "pt": "Chave de produto sensível à caixa para SF 2400 AC e SF 800 em configurações se o modo local for usado\nAdicionar sensor e controle de \"SmartMode\"",
        "nl": "Match hoofdlettergevoelige productsleutel voor SF 2400 AC en SF 800 in instellingen als lokale modus wordt gebruikt\nVoeg sensor en bediening van \"SmartMode\" toe",
        "fr": "Clé de produit sensible à la casse pour SF 2400 AC et SF 800 dans les paramètres si le mode local est utilisé\nAjouter le capteur et le contrôle de \"SmartMode\"",
        "it": "Chiave di prodotto sensibile caso di corrispondenza per SF 2400 AC e SF 800 nelle impostazioni se la modalità locale viene utilizzata\nAggiungi sensore e controllo di \"SmartMode\"",
        "es": "Clave de producto sensible de caso de coincidencia para SF 2400 AC y SF 800 en ajustes si se utiliza el modo local\nAñadir sensor y control de \"SmartMode\"",
        "pl": "Klucz produktu wrażliwego na dopasowanie dla SF 2400 AC i SF 800 w ustawieniach w trybie lokalnym\nDodaj czujnik i sterowanie \"SmartMode\"",
        "uk": "У разі використання чутливого продукту для SF 2400 AC та SF 800 у налаштуваннях, якщо використовується локальний режим\nДодати датчик і контроль \"SmartMode\"",
        "zh-cn": "如果使用本地模式, 匹配 SF 2400 AC 和 SF 800 的大小写敏感产品密钥\n添加“ SmartMode” 的传感器和控制"
      },
      "1.15.3-alpha.0": {
        "en": "Match case sensitive product key for SF 2400 AC",
        "de": "Passender Case sensitiver Produktschlüssel für SF 2400 AC",
        "ru": "Ключ для чувствительного кейса для SF 2400 AC",
        "pt": "Chave de produto sensível à caixa para SF 2400 AC",
        "nl": "Match hoofdlettergevoelige productsleutel voor SF 2400 AC",
        "fr": "Clé de produit sensible à la coque pour SF 2400 AC",
        "it": "Chiave di prodotto sensibile caso per SF 2400 AC",
        "es": "Clave de producto sensible de caso de coincidencia para SF 2400 AC",
        "pl": "Klucz produktu wrażliwego na dopasowanie dla SF 2400 AC",
        "uk": "Ключ до чутливого продукту для SF 2400 AC",
        "zh-cn": "匹配 SF 2400 AC 的大小写敏感产品密钥"
      },
      "1.15.2": {
        "en": "Fix missing SF 800 & 2400 AC in local mode settings",
        "de": "Fehlerhafte SF 800 & 2400 AC in lokalen Moduseinstellungen beheben",
        "ru": "Исправление пропущенных SF 800 и 2400 AC в локальных настройках режима",
        "pt": "Corrigir falta SF 800 & 2400 AC em configurações de modo local",
        "nl": "Fix ontbrekende SF 800 & 2400 AC in lokale modus instellingen",
        "fr": "Correction manquante SF 800 & 2400 AC en mode local",
        "it": "Fissare SF 800 & 2400 AC mancanti nelle impostazioni di modalità locale",
        "es": "Fijar SF 800 & 2400 AC desaparecidos en la configuración del modo local",
        "pl": "Naprawianie brakujących SF 800 & 2400 AC w lokalnych ustawieniach trybu",
        "uk": "Виправлення відсутніх SF 800 & 2400 AC в налаштуваннях локального режиму",
        "zh-cn": "在本地模式设置中修复缺失的 SF 800 & 2400 AC"
      },
      "1.15.1": {
        "en": "Fix missing Solar Input 3 & 4 on Solarflow 800 Pro\nFix 'packPower' state did not set to 0 if no input/output",
        "de": "Fix fehlende Solar Input 3 & 4 auf Solarflow 800 Pro\n'packPower' Zustand wurde nicht auf 0 gesetzt, wenn keine Eingabe/Ausgabe",
        "ru": "Недостающий Solar Input 3 и 4 на Solarflow 800 Pro\nСостояние «packPower» не устанавливается на 0, если нет ввода/вывода",
        "pt": "Corrigir falta de entrada solar 3 & 4 no Solarflow 800 Pro\nCorrigir o estado de 'packPower' não definido para 0 se não houver entrada/saída",
        "nl": "Fix ontbrekende Solar Input 3 & 4 op Solarflow 800 Pro\nFix 'packPower' status is niet ingesteld op 0 als geen invoer/uitvoer",
        "fr": "Correction de l'entrée solaire 3 & 4 manquante sur Solarflow 800 Pro\nCorrection de l'état 'packPower' n'a pas été réglé à 0 si aucune entrée/sortie",
        "it": "Fissare l'ingresso solare mancante 3 & 4 su Solarflow 800 Pro\nFissare lo stato 'packPower' non è stato impostato a 0 se nessun input/output",
        "es": "Fijar la entrada solar faltante 3 \" 4 en el flujo solar 800 Pro\nFijar 'paquetePower' estado no se estableció a 0 si no entrada / salida",
        "pl": "Popraw brakujące wejście Solar 3 i 4 na Solarflow 800 Pro\nStan 'packPower' nie ustawił się na 0, jeśli nie ma wejścia / wyjścia",
        "uk": "Виправлення відсутніх сонячних входів 3 & 4 на Solarflow 800 Pro\nВиправлення 'packPower' стану не встановлено до 0, якщо немає входу/виходу",
        "zh-cn": "在太阳流800 Pro 上修复缺失的太阳输入 3 & 4\n将“ packPower” 状态固定为 0 如果没有输入/输出"
      },
      "1.15.0": {
        "en": "Add 'packPower' state, which shows combined power from (packInputPower and outputPackPower). Discharging will be shown with a negative value.\nAdd 'hyperTmp' to Solarflow 800 devices in hope this will show the temperature of the Solarflow 800 (can not test it due to lack of test device).",
        "de": "Fügen Sie 'packPower' Zustand hinzu, der kombinierte Leistung von (packInputPower und outputPackPower) zeigt. Das Abladen wird mit einem negativen Wert angezeigt.\nFügen Sie 'hyperTmp' zu Solarflow 800 Geräten in der Hoffnung, dies zeigt die Temperatur des Solarflow 800 (kann nicht testen, es aufgrund fehlender Testvorrichtung).",
        "ru": "Добавьте состояние «packPower», которое показывает комбинированную мощность от (packInputPower и outputPackPower). Разрядка будет показана с отрицательным значением.\nДобавьте «гиперTmp» в устройства Solarflow 800 в надежде, что это покажет температуру Solarflow 800 (не может проверить его из-за отсутствия тестового устройства).",
        "pt": "Adicione o estado 'packPower', que mostra potência combinada de (packInputPower e saídaPackPower). O descarregamento será mostrado com um valor negativo.\nAdicione 'hyperTmp' aos dispositivos Solarflow 800 na esperança de que isso mostre a temperatura do Solarflow 800 (não pode testá-lo devido à falta de dispositivo de teste).",
        "nl": "Voeg 'packPower' staat, die gecombineerde kracht toont van (packInputPower en outputPackPower). Uitladen zal worden getoond met een negatieve waarde.\nVoeg 'hyperTmp' toe aan Solarflow 800 apparaten in de hoop dat dit de temperatuur van de Solarflow 800 zal tonen (kan het niet testen door gebrek aan testapparaat).",
        "fr": "Ajouter l'état \"packPower\", qui affiche la puissance combinée de (packInputPower et sortiePackPower). La charge sera affichée avec une valeur négative.\nAjouter 'hyperTmp' aux appareils Solarflow 800 dans l'espoir que cela montrera la température du Solarflow 800 (ne peut pas le tester en raison de l'absence de dispositif d'essai).",
        "it": "Aggiungi 'packPower' stato, che mostra potenza combinata da (packInputPower e outputPackPower). La scarica sarà mostrata con un valore negativo.\nAggiungi 'hyperTmp' a Solarflow 800 dispositivi nella speranza che questo mostrerà la temperatura del Solarflow 800 (non può testarlo a causa della mancanza di dispositivo di prova).",
        "es": "Añadir 'packPower' estado, que muestra la potencia combinada de (packInputPower y salidaPackPower). La descarga se mostrará con un valor negativo.\nAñadir 'hiperTmp' a Solarflow 800 dispositivos con la esperanza de que esto muestre la temperatura del flujo solar 800 (no puede probarlo debido a la falta de dispositivo de prueba).",
        "pl": "Dodać stan 'packPower', który pokazuje łączną moc z (packInputPower i outputPackPower). Wyładowanie zostanie pokazane z wartością ujemną.\nDodać 'hiperTmp' do urządzeń Solarflow 800 w nadziei, że pokaże to temperaturę Solarflow 800 (nie można go przetestować z powodu braku urządzenia testowego).",
        "uk": "Додати стан \"packPower\", який показує комбіновану потужність з (packInputPower і вихідPackPower). Відхилення буде показано з негативним значенням.\nДодати \"гіперTmp\" до пристроїв Solarflow 800 надії, це покаже температуру Solarflow 800 (не можна перевірити це через відсутність тестового пристрою).",
        "zh-cn": "添加“ packPower” 状态, 显示来自( pack InputPower 和 输出 PackPower ) 的综合电源 。 充电将以负值显示 .\n在 Solarflow 800 设备中添加“ hyperTmp” , 希望这将显示 Solarflow 800 的温度( 由于缺乏测试设备, 无法测试) ."
      }
    },
    "titleLang": {
      "en": "Zendure Solarflow",
      "de": "Zendure Solarflow",
      "ru": "Зендуре Соларфлоу",
      "pt": "Zendure Solarflow",
      "nl": "Zendure Solarflow",
      "fr": "Flux solaire Zendure",
      "it": "Zendur Solarflow",
      "es": "Zendure Solarflow",
      "pl": "Zendure Solarflow",
      "uk": "Zendure Solarflow",
      "zh-cn": "Zendure Solarflow"
    },
    "desc": {
      "en": "zendure-solarflow",
      "de": "Zendure-Solarflow",
      "ru": "Zendure-Solarflow",
      "pt": "zendure-solarflow",
      "nl": "zendure-solarflow",
      "fr": "zendure-solarflow",
      "it": "zendure-solarflow",
      "es": "flujo-solar-zendure",
      "pl": "zendure-solarflow",
      "uk": "zendure-solarflow",
      "zh-cn": "zendure-solarflow"
    },
    "authors": [
      "Peter <peter.frommert@outlook.com>"
    ],
    "keywords": [
      "Zendure",
      "Solarflow"
    ],
    "licenseInformation": {
      "license": "GPL-3.0-only",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "icon": "zendure-solarflow.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/nograx/ioBroker.zendure-solarflow/main/admin/zendure-solarflow.png",
    "readme": "https://github.com/nograx/ioBroker.zendure-solarflow/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "energy",
    "tier": 2,
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "adminUI": {
      "config": "materialize"
    },
    "eraseOnUpload": true,
    "dependencies": [
      {
        "js-controller": ">=5.0.19"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.4.10"
      }
    ]
  },
  "native": {
    "userName": "",
    "password": "",
    "server": "global",
    "useCalculation": false,
    "useLowVoltageBlock": false,
    "dischargeLimit": 10,
    "useRestart": true
  },
  "encryptedNative": [
    "password"
  ],
  "protectedNative": [
    "password"
  ],
  "objects": [],
  "instanceObjects": []
}
